{
    "stories": [
        {
            "id": "8935452191057792231",
            "title": "Black Friday AirPods deals: Apple earbuds are down to all-time low prices",
            "url": "https://www.businessinsider.com/guides/deals/apple-airpods-pro-airpods-second-gen-black-friday-deal-2023-11",
            "site": "businessinsider.com",
            "time": 1700506552000,
            "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
            "tags": [
                "aapl"
            ],
            "description": "You don't have to wait until Black Friday to score savings — right now AirPods and AirPods Pro are down to excellent lows prices. When you buy through our links, Insider may earn an affiliate commission. Learn moreApple AirPods are on sale now ahead of Black Friday.AmazonApple AirPods and AirPods Pro are among the top wireless earbuds you can buy, and for good reason. Their sleek design, great audio quality, and smooth connectivity with iPhones set them apart from the competition. But while they usually come with a high price tag, you can find both models on sale right now as part of an early Black Friday AirPods deal. Back down to their all-time lowest price, the AirPods Pro (second-gen) with USB-C charging are a steal at $60 off from Amazon. The AirPods Pro deliver the best sound quality of any Apple earbuds and they feature active noise cancelation (ANC) to block out background sounds. But if you don't mind losing ANC, you can get the standard AirPods (second-gen) for even less money at just $79 — which is only $10 more than the lowest they've ever dropped to. You can learn more about both models in our AirPods Pro review and AirPods 2 review. Now, it's not uncommon to find AirPods on sale throughout the year — in fact, we highly advise against ever paying full price for a pair. However, these Black Friday AirPods deals feature especially big price drops that we only see during limited-time sales like this. You can find even more top discounts on other products in our guide to the best Black Friday deals. And if you're looking for more to add to your Amazon cart, check out our guide to the best Amazon Black Friday deals too.Which AirPods should I buy?If you're torn between which AirPods to buy, know that each is designed with a different user in mind. The second-generation AirPods Pro offer an excellent balance of performance, price, and comfort for most people, and they include premium features like active noise cancelation, adaptive sound, spatial audio, and water/sweat resistance. These perks help make them our overall pick for the best AirPods you can buy.However, for the more budget-minded, the standard second-generation AirPods are still worthwhile. They deliver the same effortless connectivity with iPhones and offer solid sound quality. However, in exchange for their lower price, they're missing ANC, water resistance, and spatial audio support. Apple also sells a midrange AirPods model, the AirPods (third-gen), which typically cost about $40 more than the second-gen model. The third-gen AirPods add water resistance and spatial audio but are still missing ANC. You can learn more about them in our third-gen AirPods review.Finally, buyers who prefer an over-ear headphone design instead of earbuds, should consider the AirPods Max. These high-end headphones deliver premium sound quality, comfort, and battery life. Check out our AirPods Max review for more details. Read the original article on Business Insider",
            "tickers": [
                "aapl"
            ],
            "img" : "https://i.insider.com/655bd79c4ca513d8242c95b3?width=1000&format=jpeg&auto=webp"
        },
        {
            "id": "9140217599421873249",
            "title": "Canadian Smartphone Sales Dip Again, Apple Still Leads Marketshare",
            "url": "https://www.iphoneincanada.ca/2023/11/20/canadian-smartphone-sales-dip-again-apple-still-leads-marketshare/",
            "site": "iphoneincanada.ca",
            "time": 1700505106000,
            "favicon_url": "https://static.tickertick.com/website_icons/iphoneincanada.ca.ico",
            "tags": [
                "aapl"
            ],
            "description": "Canada’s smartphone market faced a 4% year-over-year (YoY) sales decline, marking the second consecutive quarter of downturn amid rising inflation and economic challenges. Despite the usual boost from carrier promotions during back-to-school seasons and new smartphone launches, affordability issues have led to a longer replacement cycle and a shift in focus towards Bring Your Own […] The post Canadian Smartphone Sales Dip Again, Apple Still Leads Marketshare first appeared on iPhone in Canada Blog.",
            "tickers": [
                "aapl"
            ]
        },
        {
            "id": "-8117697156660222416",
            "title": "Inside Apple’s Secretive War to Protect iPhones from Hacking",
            "url": "https://www.iphoneincanada.ca/2023/11/20/apple-war-to-protect-iphones-from-hacking/",
            "site": "iphoneincanada.ca",
            "time": 1700504134000,
            "favicon_url": "https://static.tickertick.com/website_icons/iphoneincanada.ca.ico",
            "tags": [
                "aapl"
            ],
            "description": "Apple, in its pursuit to fortify its iPhones against potential security breaches, has assembled an exclusive team of hackers at a concealed site in Paris. The post Inside Apple’s Secretive War to Protect iPhones from Hacking first appeared on iPhone in Canada Blog.",
            "tickers": [
                "aapl"
            ],
            "img" : "https://www.iphoneincanada.ca/wp-content/uploads/2023/11/apple-lab-paris.JPG"
        },
        {
            "id": "3503392461071719824",
            "title": "HandBrake 1.7 - Adds Apple VideoToolbox hardware presets and support for selecting ...",
            "url": "https://tidbits.com/watchlist/handbrake-1-7/",
            "site": "tidbits.com",
            "time": 1700504127000,
            "favicon_url": "https://static.tickertick.com/website_icons/tidbits.com.ico",
            "tags": [
                "aapl"
            ],
            "description": "Adds Apple VideoToolbox hardware presets and support for selecting multiple files at once. (Free, 42.4 MB, macOS 10.13+)",
            "tickers": [
                "aapl"
            ],
            "img" : "https://tidbits.com/uploads/2018/04/HandBrake-1.1.0-icon-384x384-c-default.png"
        },
        {
            "id": "5966670034219136550",
            "title": "Lunar Lake-MX leak suggests Intel is serious about \"outcompeting\" Apple",
            "url": "https://www.techspot.com/news/100904-lunar-lake-mx-leak-suggests-intel-serious-about.html",
            "site": "techspot.com",
            "time": 1700503920000,
            "favicon_url": "https://static.tickertick.com/website_icons/techspot.com.ico",
            "tags": [
                "aapl"
            ],
            "description": "In 2021, Intel CEO Pat Gelsinger proudly discussed the company's long-term plan to win Apple's business back by \"outcompeting\" it. Ever since he returned to Team Blue, Gelsinger has been on a quest to demonstrate that Arm-based processors aren't a big threat to x86 in the consumer space and that...Read Entire Article",
            "tickers": [
                "aapl"
            ],
            "img" : "https://www.techspot.com/images2/news/bigimage/2023/11/2023-11-20-image-10-j_1100.webp"
        },
        {
            "id": "-5932278731874317183",
            "title": "Apple plans cellular connection in laptops, finally",
            "url": "https://boingboing.net/2023/11/20/apple-plans-cellular-connection-in-laptops-finally.html",
            "site": "boingboing.net",
            "time": 1700503888000,
            "favicon_url": "https://static.tickertick.com/website_icons/boingboing.net.ico",
            "tags": [
                "aapl"
            ],
            "description": "Apple's next generation of laptops, not to be in production for several years, will include cellular connections, reports MacRumors. But they won't be like the chipsets found in its phones and high-end tablets: the company plans to integrate it into its own system-on-a-chip. — Read the rest",
            "tickers": [
                "aapl"
            ]
        },
        {
            "id": "-3122061124785364303",
            "title": "Report Details Apple’s Roadmap for OLED iPads and MacBooks",
            "url": "https://www.iphoneincanada.ca/2023/11/20/2024-oled-ipads-macbooks-release-schedule/",
            "site": "iphoneincanada.ca",
            "time": 1700503602000,
            "favicon_url": "https://static.tickertick.com/website_icons/iphoneincanada.ca.ico",
            "tags": [
                "aapl"
            ],
            "description": "According to a recent report from ET News, Apple is set to shift towards OLED displays starting with the iPad Pro in 2024, followed by other iPad models. The post Report Details Apple’s Roadmap for OLED iPads and MacBooks first appeared on iPhone in Canada Blog.",
            "tickers": [
                "aapl"
            ],
            "img" : "https://cdn.iphoneincanada.ca/wp-content/uploads/2023/11/OLED-iPad-Pro-2024-2.jpg"
        },
        {
            "id": "-5406011575746642141",
            "title": "Apple Vision Pro Might Launch in March 2024, According to Reliable Leaker",
            "url": "https://www.inverse.com/tech/apple-vision-pro-release-date-march-2024-rumor",
            "site": "inverse.com",
            "time": 1700503225000,
            "favicon_url": "https://static.tickertick.com/website_icons/inverse.com.ico",
            "tags": [
                "aapl"
            ],
            "description": "Apple's next next big product, the Vision Pro spatial computer headset, might launch within the first quarter of 2024 according to Apple reporter and leaker Mark Gurman. — Bloomberg/Bloomberg/Getty ImagesIf you haven’t already installed the public beta for iOS 17.2 and started capturing spatial video with an iPhone 15 Pro for viewing on Apple Vision Pro when it’s released in 2024, you should get on it.Word on the street — in Mark Gurman’s PowerOn newsletter on Bloomberg — is that Apple might be readying its Vision Pro “spatial computer” for a release “around March.” That would put the Vision Pro on schedule to launch in the “early next year” window that Apple has repeated several times since the device’s announcement at WWDC in June.Assuming Gurman is correct and the launch window doesn’t slip to later, we could be wearing the Vision Pro and air-gesturing our way around visionOS using its high-res color passthrough in a matter of months. We, as in customers in the U.S. where the Vision Pro will be launching first. The reset of the world will have to wait. All signs point to Apple nearing the last stretch before the Vision Pro is ready to go. In addition to letting anyone with the iOS 17.2 beta start recording spatial video with an iPhone 15 Pro, we’ve seen the latest visionOS beta reveal how to create a virtual “Persona” by holding the Vision Pro at arm’s length for creating a head scan.As I said in my hands-on back in June and in my second experience where I saw a spatial video I shot myself, the Vision Pro is a device that you will have to try for yourself before it clicks into place. The crisp color passthrough resolution, the intuitive hand and eye tracking, and top-notch spatial sound are so ahead of the competition that it makes even Meta’s impressive Quest 3 look like a toy.And try in person you will have to, according to Apple CEO Tim Cook. During its recent Q4 earnings call, Cook said Apple Stores will be the gateway to users experiencing the Vision Pro.“There's never been a product like the Vision Pro,” Cook told investors. “We're purposely bringing it out in our stores only, so we can really put a great deal of attention on the last mile of it. We'll be offering demos in the stores and it will be a very different process than the normal grab-and-go kind of process.”Of course, even if a demo of the Vision Pro’s magic-like eye and hand tracking sells you on the device, $3,500 is still a lot of money for people, even if there might be buy now, pay later (BNPL) options that could help split the cost into payment installments. I think a lot of potential buyers will have to try the Vision Pro out, and then ask themselves whether the experience will actually make their lives better. I know way too many people who bought an iPad in the early years expecting it to fully replace their laptops, only to be disappointed when it didn’t. It’s hard to say whether or not the Vision Pro will be able to replace MacBook Pros until we’ve used one for an extended period of time, but my hunch is that it won’t. The Vision Pro is a different kind of computing experience, one that’s more immersive, but also might be limited in its productivity scope at launch.",
            "tickers": [
                "aapl"
            ]
        },
        {
            "id": "7850228706898199784",
            "title": "ITV I'm A Celebrity star Jamie Lynn Spears broke protocol before isolating from campmates",
            "url": "https://www.mirror.co.uk/tv/tv-news/itv-im-celebrity-star-jamie-31484771",
            "site": "mirror.co.uk",
            "time": 1700502486000,
            "favicon_url": "https://static.tickertick.com/website_icons/mirror.co.uk.ico",
            "tags": [
                "aapl"
            ],
            "description": "Concerned ITV execs fear that Jamie Lynn Spears could quit I'm A Celebrity at the earliest opportunity after she appeared to isolate herself from the rest of the campmates",
            "tickers": [
                "aapl"
            ]
        },
        {
            "id": "813950887182486402",
            "title": "Morgan Stanley: iPhone weakness in China offset by rest of the world",
            "url": "https://www.ped30.com/2023/11/20/apple-huawei-morgan-stanley/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=apple-huawei-morgan-stanley",
            "site": "ped30.com",
            "time": 1700502440000,
            "favicon_url": "https://static.tickertick.com/website_icons/ped30.com.ico",
            "tags": [
                "aapl"
            ],
            "description": "\"Huawei vs. the iPhone 15... and Apple's AI intentions were key topics of discussion at our 2023 AP Summit.\" — Analyst Erik Woodring.",
            "tickers": [
                "aapl"
            ]
        },
        {
            "id": "6685970142566633228",
            "title": "Oled: these nine new Apple products which will benefit from it by 2027",
            "url": "https://gettotext.com/oled-these-nine-new-apple-products-which-will-benefit-from-it-by-2027/",
            "site": "gettotext.com",
            "time": 1700502299000,
            "favicon_url": "https://static.tickertick.com/website_icons/gettotext.com.ico",
            "tags": [
                "aapl"
            ],
            "description": "Oled technology is still rare at Apple. Only iPhones and Apple Watches are eligible. For large screens, the Apple firm is currently limited to mini-Led, and only for its high-end products: the 12.9” iPad Pro and 14” and 16” MacBook Pro with M1/M2 chips. /M3. According to a recent report, the transition to Oled is... Oled technology is still rare at Apple. Only iPhones and Apple Watches are eligible. For large screens, the Apple firm is currently limited to mini-Led, and only for its high-end products: the 12.9” iPad Pro and 14” and 16” MacBook Pro with M1/M2 chips. /M3. According to a recent report, the transition to Oled is fast approaching, with no fewer than nine products adopting this type of panel over the next three years. iPad and MacBook on the program ET News has provided a new batch of information surrounding Apple’s plans. According to the Taiwanese media, Oled should occupy an important place with the Apple company by 2027. For starters, iPads would adopt this screen technology very quickly. As many rumors indicate, Oled would first make its nest on iPad Pros in 2024, whether on the 11-inch or 12.9-inch model. This development would thus end the monopoly of the large screen model, which was the only tablet to feature the best screen technology from Apple: mini-Led. Two years later, the iPad mini and the iPad Air would switch to an Oled panel. Please note, we would be entitled to a mini model with a larger screen, going from 8.3 inches to 8.7 inches; For its part, the iPad Air would be available in 10.8-inch and 12.9-inch versions. However, not all iPads are in the same boat when it comes to Oled. Indeed, we would be entitled to an LTPO panel for the iPad Pro, compared to LTPS for the iPad mini and iPad Air. As a result, the Pro models would retain the exclusivity of ProMotion on the Apple tablet range, offering an adaptive refresh rate oscillating up to 120 Hz. To further differentiate its iPad Pros, Apple would consider offering a better Oled panel in 2027, according to ET News. The latter would include a color filter on the encapsulation (CoE filter), improving brightness while reducing energy consumption by 20%. In addition, this novelty would pave the way for an under-screen camera for iPads. Finally, Oled would arrive on Apple laptops in 2025. The 16-inch MacBook Pro which would be served first. The 14-inch model would follow in 2026, then the 13- and 15-inch MacBook Air in 2027. Advertising, your content continues below Source link -98",
            "tickers": [
                "aapl"
            ]
        }
    ],
    "last_id": "6685970142566633228"
}