{
    "stories": [
       
        {
            "id": "692512037318313179",
            "title": "Lytus Technologies Holdings PTV. Ltd.'s (NASDAQ:LYT) 31% Dip In Price Shows Sentiment Is Matching Revenues",
            "url": "https://finance.yahoo.com/news/lytus-technologies-holdings-ptv-ltd-102159098.html?.tsrc=rss",
            "site": "yahoo.com",
            "time": 1698834119000,
            "favicon_url": "https://static.tickertick.com/website_icons/yahoo.com.ico",
            "tags": [
                "lyt"
            ],
            "description": "Unfortunately for some shareholders, the Lytus Technologies Holdings PTV. Ltd. ( NASDAQ:LYT ) share price has dived 31...",
            "tickers": [
                "lyt"
            ],
            "img":"https://s.yimg.com/ny/api/res/1.2/YjYWTlFb1FLKH8u4OIaUAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/ac85b9dff3d3bb2fb96bae1f0ccf6a4f"
        },
        {
            "id": "1531685436522381910",
            "title": "Benign Growth For Lytus Technologies Holdings PTV. Ltd. (NASDAQ:LYT) Underpins Stock's 31% Plummet",
            "url": "https://finance.yahoo.com/news/benign-growth-lytus-technologies-holdings-100336701.html?.tsrc=rss",
            "site": "yahoo.com",
            "time": 1698833016000,
            "favicon_url": "https://static.tickertick.com/website_icons/yahoo.com.ico",
            "tags": [
                "lyt"
            ],
            "similar_stories": [
                "692512037318313179"
            ],
            "description": "Unfortunately for some shareholders, the Lytus Technologies Holdings PTV. Ltd. ( NASDAQ:LYT ) share price has dived 31...",
            "tickers": [
                "lyt"
            ]
        },
        
       
        {
            "id": "416523506482185499",
            "title": "Critical Contrast: Lytus Technologies Holdings PTV. (NASDAQ:LYT) versus LegalZoom.com (NASDAQ:LZ)",
            "url": "https://www.tickerreport.com/banking-finance/11135134/critical-contrast-lytus-technologies-holdings-ptv-nasdaqlyt-versus-legalzoom-com-nasdaqlz.html",
            "site": "tickerreport.com",
            "time": 1695124484000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "lyt"
            ],
            "description": "LegalZoom.com (NASDAQ:LZ – Get Free Report) and Lytus Technologies Holdings PTV. (NASDAQ:LYT – Get Free Report) are both small-cap industrial products companies, but which is the better business? We will contrast the two businesses based on the strength of their analyst recommendations, earnings, risk, valuation, profitability, institutional ownership and dividends. Insider & Institutional Ownership 68.0% […]",
            "tickers": [
                "lyt"
            ]
        },
        {
            "id": "5559553736645505679",
            "title": "New Insights About Lytus Technologies Holdings PTV. Ltd. (LYT)",
            "url": "https://stocksregister.com/2023/09/15/new-insights-about-lytus-technologies-holdings-ptv-ltd-lyt/",
            "site": "stocksregister.com",
            "time": 1694791800000,
            "favicon_url": "https://static.tickertick.com/website_icons/stocksregister.com.ico",
            "tags": [
                "lyt"
            ],
            "description": "Lytus Technologies Holdings PTV. Ltd. (NASDAQ:LYT) concluded the trading at $0.31 on Thursday, September 14 with a rise of 0.32% from its closing price on previous day. Taking a look at stock we notice that its last check on previous day was $0.31 with its price kept floating in the range of $0.28 and $0.35 … New Insights About Lytus Technologies Holdings PTV. Ltd. (LYT) Read More » Lytus Technologies Holdings PTV. Ltd. (NASDAQ:LYT) concluded the trading at $0.31 on Thursday, September 14 with a rise of 0.32% from its closing price on previous day. Taking a look at stock we notice that its last check on previous day was $0.31 with its price kept floating in the range of $0.28 and $0.35 on the day. Considering stock’s 52-week price range provides that LYT hit a high price of $2.27 and saw its price falling to a low level of $0.25 during that period. Over a period of past 1-month, stock came subtracting -20.87% in its value. In last 7 days, analysts came adjusting their opinions about stock’s EPS with no upward and no downward revisions, an indication which could give clearer idea about the company’s short term price movement. In contrast, when we review LYT stock’s current outlook then short term indicators are assigning it an average of 100% Sell, while medium term indicators are categorizing the stock at an average of 100% Sell. Long term indicators are suggesting an average of 100% Sell for it. Digging deeper we become aware of the PEG ratio of the LYT stock which is currently positioned at 0. It further provides that stock’s current price level is -12.20% away from its 20-day simple moving average and is -23.67% off its SMA50. Its relative strength index (RSI) for 14-periods is oscillating at 37.30 while volatility remained at 21.80% over the past week which changes to 13.02% when measuring it over the past month. Beta is valued at 1.92, while measure of average true range or ATR is currently at 0.05. Having a second look at Lytus Technologies Holdings PTV. Ltd. (NASDAQ:LYT) provides that stock’s average daily trading volume for 3 months was 381.27K, while it jumped to 0.67 million when we calculate an average volume for past 10 days. Number of outstanding shares of the stock stood at 40.57 million. The percentage of outstanding shares held by the insiders is 85.86% while it is 0.41% for the institutional holders. The figures also indicate that as of Aug 30, 2023, number of stock’s short shares was 34720.0 which implies a short ratio of 0.22. This shows down a 0.09% of Short Interest in company’s outstanding shares on the day. In August the standing of shares short improved as it was 0.17 million in the previous month. Subtraction of -45.45% by stock’s current price to its year-to-date value in last trading session is likely to be increasing investors’ interest in the stock as it is hinting an extended uptrend.",
            "tickers": [
                "lyt"
            ]
        },
        {
            "id": "5891756035657814877",
            "title": "Lytus Technologies Holdings PTV. Ltd. [LYT] is -45.45% lower this YTD. Is it still time to buy?",
            "url": "https://dbtnews.com/2023/09/15/lytus-technologies-holdings-ptv-ltd-lyt-is-45-45-lower-this-ytd-is-it-still-time-to-buy/",
            "site": "dbtnews.com",
            "time": 1694770920000,
            "favicon_url": "https://static.tickertick.com/website_icons/dbtnews.com.ico",
            "tags": [
                "lyt"
            ],
            "description": "Lytus Technologies Holdings PTV. Ltd. [NASDAQ: LYT] gained 0.32% on the last trading session, reaching $0.31 price per share at the time. The company report on September 14, 2023 at 8:05 AM that LYTUS TECHNOLOGIES LAUNCHES LYTUS STUDIOS. The setting up of Lytus Studios is a natural progression for LYTUS Technologies to serve its own … Lytus Technologies Holdings PTV. Ltd. [LYT] is -45.45% lower this YTD. Is it still time to buy? Read More » Lytus Technologies Holdings PTV. Ltd. [NASDAQ: LYT] gained 0.32% on the last trading session, reaching $0.31 price per share at the time. The company report on September 14, 2023 at 8:05 AM that LYTUS TECHNOLOGIES LAUNCHES LYTUS STUDIOS. The setting up of Lytus Studios is a natural progression for LYTUS Technologies to serve its own content needs and to take forward its vision of transforming customer experiences with technology. With Lytus Technologies’ existing customer network in India and associations in Asia, Middle East & Europe, the company plans to provide content services in the USA and in all major entertainment markets of the world. LYTUS STUDIOS is also building a unique video streaming service, LYTUS PLAY. This service will initially be offered to Lytus Technologies’ current million + users in India while launching the service concurrently in the USA. LYTUS PLAY will feature advanced personalization technology where users can feed their health goals with preferences and get curated programs and content to manage their lifestyle. LYTUS STUDIOS will be producing all the original content for the LYTUS PLAY streaming platform in its Hollywood studios. LYTUS STUDIOS will partner and collaborate with some of the best organizations in the USA that are leaders in technology and creative content creation. Lytus Technologies CEO Dharmesh Pandya said, “We are very keen to expand technology services that are transformative. With LYTUS STUDIOS we will be able to enhance the entertainment experience of our global customers by creating curated content for our upcoming platforms and for the global entertainment world.” Lytus Technologies – Director, Rajeev Kheror added, “Film & video content markets are changing and top-quality content is a necessity for market share. LYTUS STUDIOS will create cutting edge content and serve the best industry standards of global entertainment by merging creativity and technology with our full-fledged infrastructure facilities. The company already has a content pipeline for its upcoming streaming service that will be created at these studios.” About Lytus Technologies Holdings Ptv. Ltd: Lytus Technologies is a rapidly expanding technology-driven internet platform services organisation with operations in India and USA. The company offers high-value streaming and telemedicine services to over 4 million active users and monthly customers across India and USA. Lytus Technologies is a listed company under the ticker symbol “LYT” on the Nasdaq Capital Market. Through its 5,000-kilometer network of installed fibre and broadband infrastructure, the firm delivers fibre and broadband services to its client base. Currently, Lytus Technologies has nationwide Telecast and Multicast services in India providing retail and commercial customers monthly subscription-based linear video and Internet services. Lytus Technologies Holdings PTV. Ltd. represents 40.57 million in outstanding shares, while the company has a total market value of $12.62 million with the latest information. LYT stock price has been found in the range of $0.28 to $0.35. If compared to the average trading volume of 381.27K shares, LYT reached a trading volume of 4282157 in the most recent trading day, which is why market watchdogs consider the stock to be active. Here is what top equities market gurus are saying about Lytus Technologies Holdings PTV. Ltd. [LYT]: The Average True Range (ATR) for Lytus Technologies Holdings PTV. Ltd. is set at 0.05 Trading performance analysis for LYT stock Lytus Technologies Holdings PTV. Ltd. [LYT] gain into the green zone at the end of the last week, gaining into a positive trend and gaining by 1.97. With this latest performance, LYT shares dropped by -20.87% in over the last four-week period, additionally sinking by -50.64% over the last 6 months – not to mention a drop of -83.89% in the past year of trading. Overbought and oversold stocks can be easily traced with the Relative Strength Index (RSI), where an RSI result of over 70 would be overbought, and any rate below 30 would indicate oversold conditions. An RSI rate of 50 would represent a neutral market momentum. The current RSI for LYT stock in for the last two-week period is set at 37.30, with the RSI for the last a single of trading hit 38.05, and the three-weeks RSI is set at 37.96 for Lytus Technologies Holdings PTV. Ltd. [LYT]. The present Moving Average for the last 50 days of trading for this stock 0.4044, while it was recorded at 0.2976 for the last single week of trading, and 0.6419 for the last 200 days. Lytus Technologies Holdings PTV. Ltd. [LYT]: A deeper dive into fundamental analysis Operating Margin for any stock indicates how profitable investing would be, and Lytus Technologies Holdings PTV. Ltd. [LYT] shares currently have an operating margin of +4.66 and a Gross Margin at +19.96. Lytus Technologies Holdings PTV. Ltd.’s Net Margin is presently recorded at -12.35. Return on Equity for this stock declined to -23.01, with Return on Assets sitting at -4.13. An analysis of Institutional ownership at Lytus Technologies Holdings PTV. Ltd. [LYT] The top three institutional holders of LYT stocks are: VANGUARD GROUP INC with ownership of 1.31 billion shares, which is approximately 8.2089%. BLACKROCK INC., holding 1.04 billion shares of the stock with an approximate value of $170.67 trillion in LYT stocks shares; and BERKSHIRE HATHAWAY INC, currently with $150.98 trillion in LYT stock with ownership which is approximately 5.7381%.",
            "tickers": [
                "lyt"
            ]
        },
        {
            "id": "1688944680975255168",
            "title": "LYTUS TECHNOLOGIES LAUNCHES LYTUS STUDIOS",
            "url": "https://finance.yahoo.com/news/lytus-technologies-launches-lytus-studios-120500695.html?.tsrc=rss",
            "site": "yahoo.com",
            "time": 1694693100000,
            "favicon_url": "https://static.tickertick.com/website_icons/yahoo.com.ico",
            "tags": [
                "lyt"
            ],
            "description": "Mumbai, India, Sept. 14, 2023 (GLOBE NEWSWIRE) -- Lytus Technologies announces the set up and launch of LYTUS STUDIOS in the USA for its content creation and technology services that will serve global markets. LYTUS STUDIOS plans to offer cutting edge creative services along with specialized technology infrastructure for film, video, series, commercials, events, corporate and digital industries. LYTUS STUDIOS will combine next age technology that will bring together VR (Virtual Reality), AR (Aug",
            "tickers": [
                "lyt"
            ]
        },
        {
            "id": "-2006458418272940918",
            "title": "Lytus Technologies Holdings PTV. Ltd.: Form 144 - Report of proposed sale of securities",
            "url": "https://www.sec.gov/Archives/edgar/data/1816319/000196858223000483/0001968582-23-000483-index.htm",
            "site": "sec.gov",
            "time": 1694203947000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "lyt"
            ],
            "tickers": [
                "lyt"
            ]
        }
    ],
    "last_id": "-2006458418272940918"
}