{
    "stories": [
        {
            "id": "-1254568366163515118",
            "title": "MayTech Global Investments LLC Grows Stock Holdings in MakeMyTrip Limited (NASDAQ:MMYT)",
            "url": "https://www.etfdailynews.com/2023/11/20/maytech-global-investments-llc-grows-stock-holdings-in-makemytrip-limited-nasdaqmmyt/",
            "site": "etfdailynews.com",
            "time": 1700496525000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MayTech Global Investments LLC grew its stake in MakeMyTrip Limited (NASDAQ:MMYT – Free Report) by 17.9% in the second quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The institutional investor owned 193,605 shares of the technology company’s stock after purchasing an additional 29,461 shares during the period. MakeMyTrip makes […]",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-1888528788497068409",
            "title": "MayTech Global Investments LLC Raises Holdings in MakeMyTrip Limited (NASDAQ:MMYT)",
            "url": "https://www.tickerreport.com/banking-finance/11361343/maytech-global-investments-llc-raises-holdings-in-makemytrip-limited-nasdaqmmyt.html",
            "site": "tickerreport.com",
            "time": 1700496522000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MayTech Global Investments LLC raised its stake in shares of MakeMyTrip Limited (NASDAQ:MMYT – Free Report) by 17.9% during the second quarter, Holdings Channel.com reports. The institutional investor owned 193,605 shares of the technology company’s stock after buying an additional 29,461 shares during the period. MakeMyTrip accounts for about 1.0% of MayTech Global Investments LLC’s […]",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-2511716451870919495",
            "title": "Blog Post: Day 11 of $QQQ short term up-trend; 5 stocks that reached an ATH on Friday and passed the Weekly Green Bar setup: $ACLX, $APG, $MMYT, $QLYS, $ENSG",
            "url": "https://www.wishingwealthblog.com/2023/11/blog-post-day-11-of-qqq-short-term-up-trend-5-stocks-that-reached-an-ath-on-friday-and-passed-the-weekly-green-bar-setup-aclx-apg-mmyt-qlys-ensg/",
            "site": "wishingwealthblog.com",
            "time": 1700444939000,
            "tags": [
                "mmyt"
            ],
            "description": "IndicatorsGMI: 5/6GMI-2: 7/9T2108: 61%The GMI remains Green. The post Blog Post: Day 11 of $QQQ short term up-trend; 5 stocks that reached an ATH on Friday and passed the Weekly Green Bar setup: $ACLX, $APG, $MMYT, $QLYS, $ENSG first appeared on Wishing Wealth Blog. IndicatorsGMI: 5/6GMI-2: 7/9T2108: 61%The GMI remains Green. The post Blog Post: Day 11 of $QQQ short term up-trend; 5 stocks that reached an ATH on Friday and passed the Weekly Green Bar setup: $ACLX, $APG, $MMYT, $QLYS, $ENSG first appeared on Wishing Wealth Blog.",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-5496475194634019495",
            "title": "MakeMyTrip (NASDAQ:MMYT) Sets New 12-Month High at $43.14",
            "url": "https://www.tickerreport.com/banking-finance/11350734/makemytrip-nasdaqmmyt-sets-new-12-month-high-at-43-14.html",
            "site": "tickerreport.com",
            "time": 1700232641000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MakeMyTrip Limited (NASDAQ:MMYT – Get Free Report) reached a new 52-week high during trading on Wednesday . The company traded as high as $43.14 and last traded at $42.97, with a volume of 101926 shares. The stock had previously closed at $42.42. Wall Street Analyst Weigh In Several equities analysts have weighed in on the […]",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-5360470086907578014",
            "title": "MakeMyTrip Ltd: Form 144 - Report of proposed sale of securities",
            "url": "https://www.sec.gov/Archives/edgar/data/1495153/000195004723005019/0001950047-23-005019-index.htm",
            "site": "sec.gov",
            "time": 1700083016000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "mmyt"
            ],
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-5414618164141055214",
            "title": "MakeMyTrip Ltd: Form 144 - Report of proposed sale of securities",
            "url": "https://www.sec.gov/Archives/edgar/data/1495153/000195004723005014/0001950047-23-005014-index.htm",
            "site": "sec.gov",
            "time": 1700082972000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "mmyt"
            ],
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-1666025853180662935",
            "title": "MakeMyTrip Ltd: Form 144 - Report of proposed sale of securities",
            "url": "https://www.sec.gov/Archives/edgar/data/1495153/000195004723005013/0001950047-23-005013-index.htm",
            "site": "sec.gov",
            "time": 1700082957000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "mmyt"
            ],
            "similar_stories": [
                "-5360470086907578014",
                "-5414618164141055214"
            ],
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "2236380837200484915",
            "title": "What to know about MakeMyTrip Ltd (MMYT)’s sales and margins",
            "url": "https://mzpnews.com/2023/11/10/what-to-know-about-makemytrip-ltd-mmyts-sales-and-margins/",
            "site": "mzpnews.com",
            "time": 1699631640000,
            "favicon_url": "https://static.tickertick.com/website_icons/mzpnews.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "Currently, MakeMyTrip Ltd [MMYT] is trading at $40.49, up 2.29%. It is a good measure of the stock’s recent performance to check whether the stock’s short-term value is rising or falling. The MMYT shares have gain 4.34% over the last week, with a monthly amount drifted -4.61%, and not seem to be holding up well […] The post What to know about MakeMyTrip Ltd (MMYT)’s sales and margins first appeared on MZP News. Currently, MakeMyTrip Ltd [MMYT] is trading at $40.49, up 2.29%. It is a good measure of the stock’s recent performance to check whether the stock’s short-term value is rising or falling. The MMYT shares have gain 4.34% over the last week, with a monthly amount drifted -4.61%, and not seem to be holding up well over a long-time horizon. On 21, October 2023, MakeMyTrip Limited to report Fiscal 2024 Second Quarter Financial & Operating Results on October 31, 2023. In a post published today on Yahoo Finance, MakeMyTrip Limited (Nasdaq: MMYT) plans to report its fiscal 2024 second quarter financial and operating results before markets open on Tuesday, October 31, 2023. The company will post the release on its Investor Relations website ",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-5304058441870601758",
            "title": "Acadian Asset Management LLC Purchases 233,984 Shares of MakeMyTrip Limited (NASDAQ:MMYT)",
            "url": "https://www.tickerreport.com/banking-finance/11320224/acadian-asset-management-llc-purchases-233984-shares-of-makemytrip-limited-nasdaqmmyt.html",
            "site": "tickerreport.com",
            "time": 1699532754000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "mmyt"
            ],
            "similar_stories": [
                "-1254568366163515118",
                "-1888528788497068409"
            ],
            "description": "Acadian Asset Management LLC lifted its position in MakeMyTrip Limited (NASDAQ:MMYT – Free Report) by 2,299.6% in the 2nd quarter, according to its most recent 13F filing with the SEC. The institutional investor owned 244,159 shares of the technology company’s stock after acquiring an additional 233,984 shares during the period. Acadian Asset Management LLC’s holdings […]",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "6810013204540946790",
            "title": "Ranveer and Alia charm in MakeMyTrip’s latest campaign",
            "url": "https://www.traveldailymedia.com/ranveer-and-alia-charm-in-makemytrips-latest-campaign/",
            "site": "traveldailymedia.com",
            "time": 1699413609000,
            "favicon_url": "https://static.tickertick.com/website_icons/traveldailymedia.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "The post Ranveer and Alia charm in MakeMyTrip’s latest campaign appeared first on TD (Travel Daily Media) Brand TD. MakeMyTrip launched a new campaign aimed squarely at attracting new users to its platform by spotlighting the unique value propositions that set the platform apart. The post Ranveer and Alia charm in MakeMyTrip’s latest campaign appeared first on Brand TD. The post Ranveer and Alia charm in MakeMyTrip’s latest campaign appeared first on TD (Travel Daily Media) Brand TD. MakeMyTrip launched a new campaign aimed squarely at attracting new users to its platform by spotlighting the unique value propositions that set the platform apart. Confronting the usual challenges travellers encounter when booking hotels online, such as insufficient room details and overpriced hotel bookings, MakeMyTrip’s latest spots are both a solution and a revelation. The campaign brings back its beloved and inimitable ambassadors, Alia Bhatt and Ranveer Singh, cleverly revealing the depth of room-specific information available on MakeMyTrip, from the charm of sea-facing rooms to the practicalities of included amenities. These witty films also highlight attractive offers for first-time users, aligning perfectly with the timing for those planning their year-end travels. Crafted with a keen understanding of the Indian consumer, the campaign depicts everyday situations that resonate with the target audience. MakeMyTrip’s Chief Marketing Officer and Chief Business Office – Corporate, Raj Rishi Singh, encapsulated the essence of this initiative, saying, “An informed traveller is a fulfilled traveller. Our latest ad campaign embodies our commitment to provide transparency and trust right from the start. Understanding that travel is more than just a journey, but a release from life’s pressures, we ensure that every booking with MakeMyTrip paves the way for an unforgettable experience that’s both enriching and economical, allowing our customers to make the most out of their travel and the right kind of memories.” With these films, MakeMyTrip is not just showcasing a booking platform but promising a seamless travel planning experience. By introducing a significant discount for new users and showcasing the value of detailed, competitively priced offerings, MakeMyTrip intends to move the needle on how India plans and books their travel, promising a hassle-free experience for every traveller. These films have been written by Tanmay Bhat, Devaiah Bopanna, Puneet Chadha, and Deep Joshi of Moonshot. The post Ranveer and Alia charm in MakeMyTrip’s latest campaign appeared first on Brand TD.",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "8346618282765635208",
            "title": "What's Driving MakeMyTrip Ltd's Surprising 22% Stock Rally?",
            "url": "https://www.gurufocus.com/news/2120036/whats-driving-makemytrip-ltds-surprising-22-stock-rally",
            "site": "gurufocus.com",
            "time": 1699366551000,
            "favicon_url": "https://static.tickertick.com/website_icons/gurufocus.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "Check out Sarah Ketterer Stock Picks » Download GuruFolio Report of Sarah Ketterer (Updated on 11/06/2023), Check out Paul Tudor Jones Stock Picks » Download GuruFolio Report of Paul Tudor Jones (Updated on 11/06/2023), Check out Baillie Gifford Stock Picks » Download GuruFolio Report of Baillie Gifford (Updated on 11/06/2023)Related Stocks: MMYT, TNL, NCLH, TRIP,",
            "tickers": [
                "mmyt"
            ]
        }
    ],
    "last_id": "8346618282765635208"
}