{
    "stories": [
        {
            "id": "900744926552686158",
            "title": "Matt Rife Backlash Intensifies After Domestic Violence Joke In Netflix Special, Then Posting A Fake Apology Linking Out To Special Needs Helmet: “Disrespectful And Distasteful”",
            "url": "https://decider.com/2023/11/21/matt-rife-slammed-joking-domestic-violence-netflix-special-post-fake-apology-special-needs-helmet/",
            "site": "decider.com",
            "time": 1700592792000,
            "favicon_url": "https://static.tickertick.com/website_icons/decider.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "\"I figure if we start the show with domestic violence the rest of the show should be pretty smooth sailing after that,\" Rife said at the start of his stand-up special. \"I figure if we start the show with domestic violence the rest of the show should be pretty smooth sailing after that,\" Rife said at the start of his stand-up special.",
            "tickers": [
                "nflx"
            ],
            "img" : "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1kk8bp.img?w=560&h=700&m=6&x=252&y=344&s=43&d=43"
        },
        {
            "id": "-8745146809769141795",
            "title": "‘Beef’ Creator Lee Sung Jin Signs Multi-Year Overall Deal With Netflix",
            "url": "https://deadline.com/2023/11/lee-sung-jin-signs-overall-deal-netflix-1235632033/",
            "site": "deadline.com",
            "time": 1700592300000,
            "favicon_url": "https://static.tickertick.com/website_icons/deadline.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "EXCLUSIVE: Lee Sung Jin (aka Sonny Lee), creator and executive producer of the critically acclaimed series Beef, has signed a multi-year overall deal with Netflix that will extend across scripted series and feature film. The creative partnership will be overseen by Jinny Howe, Vice President, Drama Series, at Netflix, and her team, sources tell Deadline. […]",
            "tickers": [
                "nflx"
            ]
        },
        {
            "id": "-6030158232355135270",
            "title": "Sei Investments Co. Acquires 33,492 Shares of Netflix, Inc. (NASDAQ:NFLX)",
            "url": "https://www.etfdailynews.com/2023/11/21/sei-investments-co-acquires-33492-shares-of-netflix-inc-nasdaqnflx/",
            "site": "etfdailynews.com",
            "time": 1700589536000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "Sei Investments Co. increased its holdings in Netflix, Inc. (NASDAQ:NFLX – Free Report) by 4.9% during the 2nd quarter, according to its most recent Form 13F filing with the SEC. The fund owned 714,707 shares of the Internet television network’s stock after purchasing an additional 33,492 shares during the period. Netflix makes up about 0.5% […]",
            "tickers": [
                "nflx"
            ],
            "img" : "https://www.marketbeat.com/logos/netflix-inc-logo.jpg?v=20221020160512"
        },
        {
            "id": "2589836140896309985",
            "title": "Bridgerton Season 3: All you may want to know about release date, storyline, cast, filming, streaming platform and more",
            "url": "https://economictimes.indiatimes.com/news/international/us/bridgerton-season-3-all-you-may-want-to-know-about-release-date-storyline-cast-filming-streaming-platform-and-more/articleshow/105394611.cms",
            "site": "indiatimes.com",
            "time": 1700589114000,
            "favicon_url": "https://static.tickertick.com/website_icons/indiatimes.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "Netflix hit Bridgerton season 2 broke records, becoming the largest English-language series on the platform. Now, anticipation for season 3 grows. Actor Adjoa Andoh hints at a 2024 release, revealing filming details from July 2022 to March 2023. The storyline focuses on Penelope and Colin's evolving relationship, promising new twists.",
            "tickers": [
                "nflx"
            ],
            "img" : "https://img.etimg.com/thumb/msid-105394917,width-300,height-225,imgsize-60990,,resizemode-75/bridgerton-season-3-all-you-may-want-to-know-about-release-date-storyline-cast-filming-streaming-platform-and-more.jpg"
        },
        {
            "id": "2645914396238713786",
            "title": "Matt Rife Ignites Backlash Over Domestic Violence Joke in Netflix Special and Mock ‘Apology’ That Links to Website for Special Needs Helmets",
            "url": "https://variety.com/2023/tv/news/matt-rife-backlash-domestic-violence-joke-fake-apology-1235803818/",
            "site": "variety.com",
            "time": 1700588188000,
            "favicon_url": "https://static.tickertick.com/website_icons/variety.com.ico",
            "tags": [
                "nflx"
            ],
            "similar_stories": [
                "900744926552686158"
            ],
            "description": "Comedian Matt Rife has ignited controversy with his Netflix special “Natural Selection,” which launched Nov. 15 on the streaming service. The special kicks off with a joke about domestic violence. In what appeared to be an apology posted to his Instagram story, Rife directed anyone offended by his jokes to a link that led them […]",
            "tickers": [
                "nflx"
            ],
            "img" : "https://variety.com/wp-content/uploads/2023/11/GettyImages-1780299156.jpg?w=1000&h=563&crop=1&resize=1000%2C563"
        },
        {
            "id": "-6753211143999812311",
            "title": "'Scott Pilgrim Takes Off' Isn’t Getting a Season 2 — And It Probably Shouldn’t",
            "url": "https://www.inverse.com/entertainment/scott-pilgrim-takes-off-season-2",
            "site": "inverse.com",
            "time": 1700587857000,
            "favicon_url": "https://static.tickertick.com/website_icons/inverse.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "Netflix’s “alternate-reality sequel” has been a long time coming, but this could be the last Scott Pilgrim adventure we get for a while. — NetflixThere’s a lot of expectation following a series like Scott Pilgrim Takes Off. As the long-awaited follow-up to a millennial cult classic, the Netflix series has massive shoes to fill. But rather than try to match fan hopes, Scott Pilgrim Takes Off works hard to subvert them. The series isn’t so much a remake as it is “an alternate-reality sequel,” according to Edgar Wright, who serves as executive producer. It swerves in a completely new direction, allowing creator Bryan O’Malley and co-writer BenDavid Grabinski to tell a new story on the foundation of the old. Diverging from the source material would also allow Takes Off to continue the adventures of Scott Pilgrim (Michael Cera), Ramona Flowers (Mary Elizabeth Winstead), and the League of Evil Exes, but does that mean a second season is in the works? Maybe someday, but for now, that’s probably the last thing on O’Malley or Grabinski’s mind. “It’s self-contained for now,” O’Malley told Rolling Stone. “I never say never, but right now, it seems like it would take about 50 different miracles simultaneously for another season to happen.” The choice to make Takes Off self-contained is related to the longevity of modern shows, particularly those on streaming platforms like Netflix. “People are always complaining about how shows get canceled after one season. So we hedged our bets immediately, and tried to make a self-contained one season,” O’Malley said.“We put everything we had into this, and we think it has a really great ending that we’re proud of,” Grabinski added. “Maybe some day one of us will text each other an idea that’s really great for a Season 2. But for now, my entire brain and heart is in this thing, and just getting it out into the world.”Technically, Scott Pilgrim Takes Off sets up a potential conflict that could see Ramona’s ultimate ex, Gideon Graves (Jason Schwartzman), and his new girlfriend, Julie Powers (Aubrey Plaza), strike an evil alliance. But that’s just one loose thread in a series that otherwise resolves most of its issues. More than any Scott Pilgrim story that preceded it, Takes Off provides real closure for each member of its ensemble, even the evil exes. Heroes and villains alike get the chance to grow and change, and while it would be fun to see them continue to shake their arrested development in future stories, it’s probably something best left to our imagination. O’Malley and Grabinski are still fresh off all the work of getting this show made, so it makes sense that they aren’t interested in immediately continuing it. While that could very well change in a few years, and the cast and crew could reunite to develop a second season of Takes Off, it’s not likely. To quote O’Malley, though, never say never. Fan hopes made the show possible in the first place, and they could be the key to getting another chapter of the story, too.Scott Pilgrim Takes Off is streaming on Netflix.",
            "tickers": [
                "nflx"
            ]
        },
        {
            "id": "-4732042312973255910",
            "title": "Look: Theo James, Kaya Scodelario appear in photos for Guy Ritchie's 'The Gentlemen'",
            "url": "https://www.upi.com/Entertainment_News/TV/2023/11/21/Gentlemen-series-photos-Guy-Ritchie-Theo-James-Netflix/6511700586264/",
            "site": "upi.com",
            "time": 1700587840000,
            "favicon_url": "https://static.tickertick.com/website_icons/upi.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "\"The Gentlemen,\" a new series based on the Guy Ritchie action comedy film, is coming to Netflix. \"The Gentlemen,\" a new series based on the Guy Ritchie action comedy film, is coming to Netflix.",
            "tickers": [
                "nflx"
            ],
            "img" : "https://cdnph.upi.com/svc/sv/upi/6511700586264/2023/1/3a499f61114eadda81c63977d127764b/The-Gentlemen-Theo-James-Kaya-Scodelario-appear-in-photos-for-Guy-Ritchie-series.jpg"
        },
        {
            "id": "5707979850902647912",
            "title": "The Gentlemen: First look of Theo James, Kaya Scodelario and others is out. Check it here",
            "url": "https://economictimes.indiatimes.com/news/international/us/the-gentlemen-first-look-of-theo-james-kaya-scodelario-is-out-check-it-here/articleshow/105394437.cms",
            "site": "indiatimes.com",
            "time": 1700587812000,
            "favicon_url": "https://static.tickertick.com/website_icons/indiatimes.com.ico",
            "tags": [
                "nflx"
            ],
            "similar_stories": [
                "-4732042312973255910"
            ],
            "description": "First look of the main characters of 'The Gentlemen' has been released by Netflix. All eight episodes of The Gentlemen premiere in 2024 but the official date of the release is not out yet.",
            "tickers": [
                "nflx"
            ]
        },
        {
            "id": "-4319658748027484368",
            "title": "Allure Bridal to Debut ‘Bridgerton’ Wedding Collection",
            "url": "https://wwd.com/pop-culture/new-fashion-releases/allure-bridal-bridgerton-wedding-collection-release-info-1235943683/",
            "site": "wwd.com",
            "time": 1700587800000,
            "favicon_url": "https://static.tickertick.com/website_icons/wwd.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "Allure Bridal collaborated with Netflix and costume designer Lyn Paolo to release a bridalwear collection inspired by the Shondaland shows “Bridgerton” and “Queen Charlotte: A Bridgerton Story.\"",
            "tickers": [
                "nflx"
            ]
        },
        {
            "id": "7859141050325216696",
            "title": "What's New on Netflix in December 2023",
            "url": "https://lifehacker.com/entertainment/netflix-december-2023",
            "site": "lifehacker.com",
            "time": 1700587800000,
            "favicon_url": "https://static.tickertick.com/website_icons/lifehacker.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "Stream new comedy, Bradley Cooper's \"Maestro,\" and the end of \"The Crown.\"",
            "tickers": [
                "nflx"
            ]
        },
        {
            "id": "-5162315380354100605",
            "title": "Brendan Fraser to Star in Searchlight Comedy ‘Rental Family’ as First Role Since Oscar Win",
            "url": "https://variety.com/2023/film/news/brendan-fraser-searchlight-comedy-rental-family-first-role-since-oscar-win-1235803972/",
            "site": "variety.com",
            "time": 1700586806000,
            "favicon_url": "https://static.tickertick.com/website_icons/variety.com.ico",
            "tags": [
                "nflx"
            ],
            "description": "Brendan Fraser, a newly minted Oscar winner, is set to star in the Searchlight Pictures comedic drama “Rental Family.” Mitsuyo Miyazaki, who goes by Hikari and is best known for Netflix’s “Beef,” is directing the film, in addition to producing and co-writing the script. Stephen Blahut, who collaborated with Hikari on the docu-drama “37 Seconds,” […]",
            "tickers": [
                "nflx"
            ]
        }
    ],
    "last_id": "-5162315380354100605"
}
