{
    "stories": [
        {
            "id": "-4141006055466748941",
            "title": "Why Is Reliance Global (RELI) Stock on the Move Today?",
            "url": "https://investorplace.com/2023/11/why-is-reliance-global-reli-stock-on-the-move-today/",
            "site": "investorplace.com",
            "time": 1700574285000,
            "favicon_url": "https://static.tickertick.com/website_icons/investorplace.com.ico",
            "tags": [
                "reli"
            ],
            "description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Reliance Global stock is on the move Tuesday after the company first announced, and then withdrew, a public offering for RELI shares. The post Why Is Reliance Global (RELI) Stock on the Move Today? appeared first on InvestorPlace. More From InvestorPlace ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors",
            "tickers": [
                "reli"
            ],
            "img" : "https://investorplace.com/wp-content/uploads/2019/08/retail1600d-768x432.jpg"
        },
        {
            "id": "-4117282406443834061",
            "title": "Reliance Global Group Announces Letter of Intent for Most Significant Acquisition to Date",
            "url": "https://finance.yahoo.com/news/reliance-global-group-announces-letter-133000606.html?.tsrc=rss",
            "site": "yahoo.com",
            "time": 1700573400000,
            "favicon_url": "https://static.tickertick.com/website_icons/yahoo.com.ico",
            "tags": [
                "reli"
            ],
            "description": "Post acquisition, Reliance’s revenue expected to increase greater than 100% Attractive consolidated EBITDA returns expected for FY’24 and beyond LAKEWOOD, N.J., Nov. 21, 2023 (GLOBE NEWSWIRE) -- Reliance Global Group, Inc. (Nasdaq: RELI; RELIW) (“Reliance”, “we” or the “Company”), today announced it has entered into a Letter of Intent (LOI) to acquire a well established benefits enrollment company (the “Target”). The Target is a leading provider of voluntary benefits to approximately 45,000 empl",
            "tickers": [
                "reli"
            ]
        },
        {
            "id": "9193111089989999496",
            "title": "Reliance plans to invest $2.40 billion in West Bengal over three years",
            "url": "https://www.marketscreener.com/quote/stock/RELIANCE-INDUSTRIES-LTD-9058833/news/Reliance-plans-to-invest-2-40-billion-in-West-Bengal-over-three-years-45407977/?utm_medium=RSS&utm_content=20231121",
            "site": "marketscreener.com",
            "time": 1700572923000,
            "favicon_url": "https://static.tickertick.com/website_icons/marketscreener.com.ico",
            "tags": [
                "reli"
            ],
            "description": "(marketscreener.com) India's Reliance Industries plans to invest 200 billion rupees in eastern state of West Bengal over next three years to expand Reliance's telecom, retail, energy businesses in the state, Chairman Mukesh Ambani said on Tuesday. ",
            "tickers": [
                "reli"
            ],
            "img" : "https://cdn.zonebourse.com/images/resize.php?w=464&h=261&f=/images/reuters/2021-10/2021-10-22T150108Z_1_LYNXMPEH9L0T9_RTROPTP_3_RELIANCE-RESULTS.JPG&strict=1"
        },
        {
            "id": "-7069304177028682972",
            "title": "Reliance Global Group, Inc. Withdraws Proposed Underwritten Public Offering",
            "url": "https://www.benzinga.com/pressreleases/23/11/g35891540/reliance-global-group-inc-withdraws-proposed-underwritten-public-offering",
            "site": "benzinga.com",
            "time": 1700568900000,
            "favicon_url": "https://static.tickertick.com/website_icons/benzinga.com.ico",
            "tags": [
                "reli"
            ],
            "description": "Lakewood, NJ, Nov. 21, 2023 (GLOBE NEWSWIRE) -- Reliance Global Group, Inc. (NASDAQ:RELI) (\"Reliance Global Group\" or the \"Company\"), which combines artificial intelligence (AI) and cloud-based technologies with the personalized experience of a traditional insurance agency under the RELI Exchange umbrella, today announced it has withdrawn its previously announced underwritten public offering. Ezra Beyman, CEO of Reliance, commented, \"I am committed to protecting the interests of our shareholders and did not believe the final terms were favorable. As a result, we chose not to raise capital in this market. As in the past, I have been and am willing to step in and fund cash needs of the Company, should there be a need. We at Reliance are very excited about the Company's horizon and prospects as we continue to follow through on our OneFirm vision and RELI Exchange consolidation, expected to bring even greater returns to our investors.\" This press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. About Reliance Global Group Reliance Global Group, Inc. (NASDAQ:RELI, RELIW)) ...Full story available on Benzinga.com",
            "tickers": [
                "reli"
            ],
            "img" : "https://s3.amazonaws.com/cms.ipressroom.com/270/files/202009/fddb38f71880b43c_1597427143939_5ced4d3052925a0004223746_logo"
        },
        {
            "id": "3297455555479142521",
            "title": "Made money in small and midcaps? Book some profit and raise allocation to largecaps: Abhay Agarwal",
            "url": "https://economictimes.indiatimes.com/markets/expert-view/made-money-in-small-and-midcaps-book-some-profit-and-raise-allocation-to-largecaps-abhay-agarwal/articleshow/105385718.cms",
            "site": "indiatimes.com",
            "time": 1700562697000,
            "favicon_url": "https://static.tickertick.com/website_icons/indiatimes.com.ico",
            "tags": [
                "reli"
            ],
            "description": "“Among the largecaps, we have added Reliance, Kotak Bank, Dr Reddy's and Divi's. We are turning quite positive on largecap pharma segment because after years of struggle with pricing and volumes in the US markets and the struggles with US FDA, this is a sector which is now seeing good traction and is very competitive right now.”",
            "tickers": [
                "reli"
            ],
            "img" : "https://img.etimg.com/thumb/msid-105385698,width-210,height-158,imgsize-42940,,resizemode-75/abhay-agarwal-piper-serica-1200.jpg"
        },
        {
            "id": "-3062718176308074193",
            "title": "Reliance to open Tira beauty store in Delhi",
            "url": "https://www.indiaretailing.com/2023/11/21/reliance-to-open-tira-beauty-store-in-delhi/",
            "site": "indiaretailing.com",
            "time": 1700552192000,
            "favicon_url": "https://static.tickertick.com/website_icons/indiaretailing.com.ico",
            "tags": [
                "reli"
            ],
            "description": "Tira has taken about 3,000 sq. ft. space on the ground floor of the DLF mall in Saket for the same New Delhi: Reliance Retail’s beauty brand Tira has taken space in DLF Avenue Mall in New Delhi and that could probably be the first Tira store in the national capital region (NCR), according to […] The post Reliance to open Tira beauty store in Delhi appeared first on India Retailing. Tira has taken about 3,000 sq. ft. space on the ground floor of the DLF mall in Saket for the same New Delhi: Reliance Retail’s beauty brand Tira has taken space in DLF Avenue Mall in New Delhi and that could probably be the first Tira store in the national capital region (NCR), according to three people familiar with the development. Tira has taken about 3,000 sq. ft. space on the ground floor of the DLF mall in Saket, in a space that was previously occupied by US-based fashion brand Forever 21. “Forever 21 is out of DLF Avenue Mall,” said one of the persons. It is, however, unclear whether Forever 21’s lease ran out or there was any other reason for its exit from the New Delhi shopping centre. Aditya Birla Fashion & Retail operates Forever 21 stores in India. It is a general practice in malls to replace existing brands to pave way for new labels to maintain their relevance and to add freshness to the brand mix. Reliance Retail is currently undertaking the fit-outs of the upcoming Tira store that is located right next to the Uniqlo anchor store in the Saket mall. DLF Avenue Mall is conjoined with another prominent shopping centre of Nexus Select Citywalk and collectively they form the Saket District Centre, a major shopping destination in South Delhi. Another person said Tira is expected to open its door in the New Delhi mall in February. Reliance Retail did not respond to IndiaRetailing’s email seeking comment. Spearheaded by Isha Ambani, the daughter of India’s richest man Mukesh Ambani, Tira is an omnichannel beauty venture aiming to tap the torrid growth for beauty and cosmetics products in India in recent years. Reliance Retail is aggressively pushing its beauty offerings with the launch of Tira and is also working on a mass market beauty and cosmetics format called Blush Lace. Separately, earlier this month, Reliance Retail acquired India franchisee business of Sephora from Arvind Fashions, inheriting Sephora’s network of 26 stores across 13 cities from Arvind Fashions. Read more about it here. Tira stores are adorned with digital touchpoints including a vending machine that dispenses beauty treats and samples for customer to take home. Tira sells more than 150 Indian and global brands in its stores. Reliance Retail introduced Tira as an e-commerce platform in February 2023 and subsequently, in April, unveiled its flagship store at Jio World Drive in the Bandra Kurla Complex, Mumbai, a 4,300 sq ft store that was designed by London-based innovation studio, Dalziel & Pow. So far, the country’s largest retailer by sales has rolled out two more Tira stores in Hyderabad and Chennai. As part of the high-profile launch, Tira also hired three Bollywood actors Kareena Kapoor Khan, Kiara Advani, and Shah Rukh Khan’s daughter Suhana Khan as its brand ambassadors. The post Reliance to open Tira beauty store in Delhi appeared first on India Retailing.",
            "tickers": [
                "reli"
            ]
        },
        {
            "id": "-5519145746598801637",
            "title": "Reliance Global Group, Inc. Announces Proposed Underwritten Public Offering",
            "url": "https://www.globenewswire.com/en/news-release/2023/11/20/2783605/0/en/Reliance-Global-Group-Inc-Announces-Proposed-Underwritten-Public-Offering.html",
            "site": "globenewswire.com",
            "time": 1700514900000,
            "favicon_url": "https://static.tickertick.com/website_icons/globenewswire.com.ico",
            "tags": [
                "reli"
            ],
            "similar_stories": [
                "-7069304177028682972"
            ],
            "description": "Lakewood, NJ, Nov. 20, 2023 (GLOBE NEWSWIRE) -- Reliance Global Group, Inc. (NASDAQ: RELI) (“Reliance Global Group” or the “Company”), which combines artificial intelligence (AI) and cloud-based technologies with the personalized experience of a traditional insurance agency under the RELI Exchange umbrella, today announced it has commenced an underwritten public offering. Reliance Global Group intends to use the net proceeds from the offering for working capital to grow the Company and general corporate purposes.",
            "tickers": [
                "reli"
            ],
            "img" : "https://th.bing.com/th/id/OIP.lAToVhzkDw-iY6hWkaA-EgHaEw?w=273&h=180&c=7&r=0&o=5&dpr=1.1&pid=1.7"
        },
        {
            "id": "5407633148591022169",
            "title": "Reliance Global Group, Inc.: Form 8-K - Current report",
            "url": "https://www.sec.gov/Archives/edgar/data/1812727/000149315223042086/0001493152-23-042086-index.htm",
            "site": "sec.gov",
            "time": 1700514088000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "reli"
            ],
            "tickers": [
                "reli"
            ]
        },
        {
            "id": "1994572237632589334",
            "title": "Reliance Global Group, Inc. (NASDAQ:RELI) Q3 2023 Earnings Call Transcript",
            "url": "https://www.insidermonkey.com/blog/reliance-global-group-inc-nasdaqreli-q3-2023-earnings-call-transcript-1225988/",
            "site": "insidermonkey.com",
            "time": 1700494946000,
            "favicon_url": "https://static.tickertick.com/website_icons/insidermonkey.com.ico",
            "tags": [
                "reli"
            ],
            "description": "Reliance Global Group, Inc. (NASDAQ:RELI) Q3 2023 Earnings Call Transcript November 19, 2023 Operator: Greetings. Welcome to the Reliance Global Third Quarter 2023 Financial Results and Business Update Conference Call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator Instructions] Please note this conference is […] Reliance Global Group, Inc. (NASDAQ:RELI) Q3 2023 Earnings Call Transcript November 19, 2023 Operator: Greetings. Welcome to the Reliance Global Third Quarter 2023 Financial Results and Business Update Conference Call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator Instructions] Please note this conference is being recorded. I will now turn the conference over to your host, Ted Ayvas, Investor Relations. Ted, you may begin. Ted Ayvas: Thanks, Paul. Good afternoon, and thank you for joining Reliance Global Group’s 2023 Third Quarter Financial Results and Business Update Conference Call. On the call with us today are Ezra Beyman, Chairman and Chief Executive Officer of Reliance Global Group, and Joel Markovits, Chief Financial Officer at Reliance. Earlier today, the company announced its operating results for the three months ended September 30, 2023. The press release is posted on the company’s website, www.relianceglobalgroup.com. In addition, the company has filed its quarterly report on Form 10-Q with the US Securities and Exchange Commission, as well, which can also be accessed on the company’s website as well as the SEC’s website at www.sec.gov. If you have any questions after the call or would like any additional information about the company, please contact Crescendo Communications at 212-671-1020. Before Mr. Beyman reviews the company’s operating results for the quarter ended September 30, 2023, we would like to remind everyone that this conference call may contain forward-looking statements. All statements other than statements of historical facts contained in this conference call, including statements regarding our future results of operations and financial position, strategy and plans and our expectations for future operations are forward-looking statements. The words anticipate, estimate, expect, project, plan, seek, intend, believe, may, might, will, should, could, likely, continue, design and the negative of such terms and other words and terms of similar expressions are intended to identify forward-looking statements. These forward-looking statements are based largely on the company’s current expectations and projections about future events and trends that it believes may affect its financial condition, results of operations, strategy, short-term and long-term business operations and objectives and financial needs. These forward-looking statements are subject to several risks, uncertainties and assumptions as described in the company’s Form 10-K filed with the US Securities and Exchange Commission on March 30, 2023. Because of these risks, uncertainties and assumptions, the forward-looking events and circumstances discussed in this conference call may not occur, and actual results could differ materially and adversely from those anticipated or implied in the forward-looking statements. You should not rely upon forward-looking statements as predictions of future events. Although the company believes that the expectations reflected in the forward-looking statements are reasonable, it cannot guarantee future results, level of activity, performance, or achievements. In addition, neither the company nor any person assumes responsibility for the accuracy and completeness of any of these forward-looking statements. The company disclaims any duty to update any of these forward-looking statements. All forward-looking statements attributable to the company are expressly qualified in their entirety by these cautionary statements as well as others made in this conference call. You should evaluate all forward-looking statements made by the company in the context of these risks and uncertainties. Having said that, I’d now like to turn the call over to Ezra Beyman, Chairman and Chief Executive Officer of Reliance Global Group. Ezra? Ezra Beyman: Thank you, Ted. Good afternoon, and thanks to everyone for joining us today. We are pleased to report a 16% and 19% year-over increase in revenue for the third quarter and first nine months of 2023, respectively. This growth primarily stems from the organic expansion of our business, bolstered by our acquisition of Barra & Associates in April 2022. Following the acquisition and the rebranding to RELI Exchange, our agency network has demonstrated consistent growth. Despite substantial investments in RELI Exchange, we managed to cut our operational losses by over 21% in the first nine months of 2023 compared to the same period last year. Additionally, our working capital has increased [$5.3] (ph) million or 117% since the end of the 2022 fiscal year. An experienced insurance agent explaining the benefits of an insurance product to a customer. RELI Exchange is crucial to our long-term strategic vision and growth, and we are extremely pleased with the significant progress we’ve made in such a short time. By equipping independent agencies with a robust array of business tools, which include cutting-edge technologies and AI capabilities, RELI Exchange enables these agencies to not only compete but often outperform larger national agencies in their services. Looking ahead, we’re moving to consolidate our stand-alone agencies under the umbrella of RELI Exchange. We’re confident this move will bring substantial benefits and efficiencies to both our agents and their clients. This consolidation is expected to significantly enhance the company’s market presence across the US as Reliance Global Group will now operate under a unified brand across all business lines. We also anticipate that this will fortify our relationships with carriers, enabling us to negotiate better commission and bonus contracts, thanks to increased business volumes. Additionally, the strategy will empower our RELI Exchange agency partners, assuring them that the company can insist and effectively securing policies along their broad range of insurance products. It will also create more cross-selling opportunities for our agency partners and allow the company to more efficiently leverage the extensive talent within our organization, particularly in their insurance specialties. Lastly, we believe this unified single firm approach will position us to scale rapidly and seamlessly integrate new acquisitions. I would now like to turn the call over to Joel Markovits, Chief Financial Officer of Reliance Global, who will review the financial results for the quarter ended September 30, 2023. Joel Markovits: Thank you, Ezra, and good afternoon. Great to be here with you all today. I’m super charged to share our financial results for the third quarter of 2023. Figures presented are approximates. The company’s revenue for the three and nine months ended September 30, 2023, was $3.3 million and $10.4 million, respectively. For the three months, this represents a 16% increase from $2.8 million in the previous year. For nine months, this represents a 19% increase from $8.7 million in the previous year. As mentioned by Ezra, the two primary factors driving the enhancements are organic growth and the Q2 ’22 acquisition of Barra & Associates, now known as RELI Exchange. Total operating expense for the three months ended 9/30/2023, increased by only 13% or $554,000 from the same period in the prior year, notwithstanding a 16% increase in top line revenue. For the nine months ended September 30, 2023, total operating expense increased by only 4% or $516,000 compared to the same period in the prior year, notwithstanding a 19% increase in top line revenue. Loss from operations increased modestly, growing 7% or $100,000 for the three months ended 9/30/2023 and actually decreased for the nine months ended 9/30/2023 by 21% or $1.2 million. These results continue to demonstrate the effectiveness of efficiencies, Reliance has incorporated in its operations, which are clearly evident in enhanced financial figures. Net loss for the three and nine months ended September 30, 2023, was $139,000 and $3 million, respectively. For the same periods in the prior year, there was net income, but that was due to significant unrealized noncash gains in the fair valuation of our derivative positions, which did not reoccur in 2023. Working capital increased by $5.4 million or 117% as of September 30, 2023, from December 31, 2022, due in part to a capital raised earlier this year, a cash collection from a legal settlement and of course, enhanced cash management incorporated by the company. With this, we conclude our prepared remarks. Happy to answer any questions or comments participants may have. Operator, kindly open the lines, please. Operator: Thank you. At this time, we will be conducting a question-and-answer session. [Operator Instructions] And the first question today is coming from Mike Albanese from EF Hutton. Mike, your line is live. See also George Soros Stock Portfolio and Goldman Sachs Stock Portfolio. Q&A Session Follow Reliance Global Group Inc. Follow Reliance Global Group Inc. We may use your email to send marketing emails about our services. Click here to read our privacy policy. Mike Albanese: Hey guys, how you doing? Ezra Beyman: Good. Mike Albanese: Good. Thanks for taking my questions here. Just a couple of quick ones. First, regarding the nice growth here, attributable to both organic and then the acquisition. Can you dissect that a little bit further and maybe just provide some insight into how much of that is organic versus how much is actually due to the acquisitions? Joel Markovits: Sure. So organic, I’d say th",
            "tickers": [
                "reli"
            ]
        },
        {
            "id": "2033679680901155096",
            "title": "Head to Head Review: BRP Group (NASDAQ:BRP) vs. Reliance Global Group (NASDAQ:RELI)",
            "url": "https://www.tickerreport.com/banking-finance/11359871/head-to-head-review-brp-group-nasdaqbrp-vs-reliance-global-group-nasdaqreli.html",
            "site": "tickerreport.com",
            "time": 1700473243000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "reli"
            ],
            "similar_stories": [
                "-4141006055466748941",
                "1994572237632589334",
                "5888245109680898232"
            ],
            "description": "BRP Group (NASDAQ:BRP – Get Free Report) and Reliance Global Group (NASDAQ:RELI – Get Free Report) are both finance companies, but which is the better stock? We will compare the two businesses based on the strength of their risk, profitability, analyst recommendations, institutional ownership, dividends, valuation and earnings. Valuation & Earnings This table compares BRP […]",
            "tickers": [
                "reli"
            ]
        },
        {
            "id": "5888245109680898232",
            "title": "Reliance Global Group, Inc. (RELI) Q3 2023 Earnings Call Transcript | $RELI",
            "url": "https://seekingalpha.com/article/4652974-reliance-global-group-inc-reli-q3-2023-earnings-call-transcript",
            "site": "seekingalpha.com",
            "time": 1700408762000,
            "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
            "tags": [
                "reli"
            ],
            "tickers": [
                "reli"
            ]
        }
    ],
    "last_id": "5888245109680898232"
}