{
    "stories": [
        {
            "id": "6482286791533241260",
            "title": "Sei Investments Co. Has $115.84 Million Stock Position in HDFC Bank Limited (NYSE:HDB)",
            "url": "https://www.etfdailynews.com/2023/11/21/sei-investments-co-has-115-84-million-stock-position-in-hdfc-bank-limited-nysehdb/",
            "site": "etfdailynews.com",
            "time": 1700591608000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Sei Investments Co. grew its stake in HDFC Bank Limited (NYSE:HDB – Free Report) by 1.2% during the second quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The firm owned 1,662,034 shares of the bank’s stock after purchasing an additional 20,177 shares during the quarter. Sei Investments […]",
            "tickers": [
                "hdb"
            ],
            "img" : "https://www.marketbeat.com/scripts/SECFilingChart.ashx?Prefix=NYSE&Symbol=HDB"
        },
        {
            "id": "5832236082306118144",
            "title": "$21,000 in debt at 26 - PLEASE help",
            "url": "https://www.reddit.com/r/personalfinance/comments/180neoi/21000_in_debt_at_26_please_help/",
            "site": "reddit.com",
            "time": 1700590438000,
            "favicon_url": "https://static.tickertick.com/website_icons/reddit.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "All of my debt is credit card consumer debt from my early 20’s that clearly got out of control. I have two personal loans through a credit union that I used to pay off some of my credit cards. One personal loan is $11,421.40 and I pay $353.60 monthly towards that. The other personal loan is $4,173.58 and I pay $158.46 monthly towards that. I have two “active” credit cards. One balance is $1,500 and I pay the minimum monthly which is $53 right now The others balance is $3,000 and I pay the minimum monthly which is $81 right now. In total I have $20,094.98 in debt and I am paying $644 monthly. I make all my payments on time but I am struggling to live. I get paid by weekly, about $800, and I pay my amounts due and 9 times out of 10 I go negative that month and have to use a CC for basic needs like food and gas. So the cycle just continues. I am looking into debt consolidation companies but I don’t want to stop paying my creditors to have a debt company negotiate a lesser amount owed as I don’t want to negatively effect my credit. But I need a lower monthly payment. National Debt Relief said I was pre approved for a loan through them / Reach Financial for 5 years at $584 a month. The problem is i’ll end up paying $35,000 in total with this plan. But, it seems to be the only plan that won’t fuck my credit and gets my debt paid, eventually. The purpose to this post (other than to vent) is to ask for advice and to pick people’s brains about what my best option may be. I was young and reckless with my credit cards and I am now trying to correct those mistakes and make a life for myself. Please help!! submitted by /u/Quick-Grocery2011 [link] [comments] All of my debt is credit card consumer debt from my early 20’s that clearly got out of control. I have two personal loans through a credit union that I used to pay off some of my credit cards. One personal loan is $11,421.40 and I pay $353.60 monthly towards that. The other personal loan is $4,173.58 and I pay $158.46 monthly towards that. I have two “active” credit cards. One balance is $1,500 and I pay the minimum monthly which is $53 right now The others balance is $3,000 and I pay the minimum monthly which is $81 right now. In total I have $20,094.98 in debt and I am paying $644 monthly. I make all my payments on time but I am struggling to live. I get paid by weekly, about $800, and I pay my amounts due and 9 times out of 10 I go negative that month and have to use a CC for basic needs like food and gas. So the cycle just continues. I am looking into debt consolidation companies but I don’t want to stop paying my creditors to have a debt company negotiate a lesser amount owed as I don’t want to negatively effect my credit. But I need a lower monthly payment. National Debt Relief said I was pre approved for a loan through them / Reach Financial for 5 years at $584 a month. The problem is i’ll end up paying $35,000 in total with this plan. But, it seems to be the only plan that won’t fuck my credit and gets my debt paid, eventually. The purpose to this post (other than to vent) is to ask for advice and to pick people’s brains about what my best option may be. I was young and reckless with my credit cards and I am now trying to correct those mistakes and make a life for myself. Please help!! submitted by /u/Quick-Grocery2011 [link] [comments]",
            "tickers": [
                "hdb"
            ]
        },
        {
            "id": "-427330436723675696",
            "title": "Deuterium Capital Management LLC Purchases 1,407 Shares of HDFC Bank Limited (NYSE:HDB)",
            "url": "https://www.etfdailynews.com/2023/11/21/deuterium-capital-management-llc-purchases-1407-shares-of-hdfc-bank-limited-nysehdb/",
            "site": "etfdailynews.com",
            "time": 1700587982000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Deuterium Capital Management LLC increased its position in shares of HDFC Bank Limited (NYSE:HDB – Free Report) by 7.7% during the 2nd quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The firm owned 19,614 shares of the bank’s stock after buying an additional 1,407 shares during the […]",
            "tickers": [
                "hdb"
            ],
            "img" : "https://www.livemint.com/lm-img/img/2023/07/16/600x338/One-can-say-that-the-ratio-is-1-68-shares-of-HDFC-_1689526550300.jpg"
        },
        {
            "id": "8914617780311785676",
            "title": "Charles Lim Capital Ltd Has $188.19 Million Stake in HDFC Bank Limited (NYSE:HDB)",
            "url": "https://www.etfdailynews.com/2023/11/21/charles-lim-capital-ltd-has-188-19-million-stake-in-hdfc-bank-limited-nysehdb/",
            "site": "etfdailynews.com",
            "time": 1700587977000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Charles Lim Capital Ltd boosted its position in HDFC Bank Limited (NYSE:HDB – Free Report) by 12.5% in the second quarter, HoldingsChannel.com reports. The firm owned 2,700,000 shares of the bank’s stock after acquiring an additional 300,000 shares during the period. HDFC Bank accounts for approximately 27.8% of Charles Lim Capital Ltd’s investment portfolio, making […]",
            "tickers": [
                "hdb"
            ],
            "img" : "https://th.bing.com/th/id/OIP.GLr_H9eLsNWAdTKlhbAGsgHaFj?w=219&h=180&c=7&r=0&o=5&dpr=1.1&pid=1.7"
        },
        {
            "id": "291878412206496231",
            "title": "Officers request help finding suspect in northwest car break-ins, stolen credit cards",
            "url": "https://www.wane.com/news/crime/officers-request-help-finding-suspect-in-northwest-car-break-ins-stolen-credit-cards/",
            "site": "wane.com",
            "time": 1700583749000,
            "favicon_url": "https://static.tickertick.com/website_icons/wane.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "The Fort Wayne Police Department is requesting help to locate a \"person of interest\" in recent car break-ins. FORT WAYNE, Ind. (WANE) — The Fort Wayne Police Department is requesting help to locate a \"person of interest\" in recent car break-ins. These vehicle incidents have occurred in the northwest quadrant of Fort Wayne as early as Nov. 3, security images show. Police say the subject supposedly stole purses out of cars and then used the credit cards inside the purses immediately after the break-ins. FWPD described the suspect as a Black male with medium-length braided hair, a mustache and a goatee. The store security footage below was from where the suspect reportedly used a stolen credit card. It is suspected that he drives a newer white Toyota Camry. Suspect walking out of store (Courtesy of Fort Wayne Police Department)Suspect checking out of store (Courtesy of Fort Wayne Police Department)Suspect checking out of store (Courtesy of Fort Wayne Police Department)Suspect checking out of store (Courtesy of Fort Wayne Police Department) Anyone with information is asked to call the Fort Wayne Police Detective Bureau at 260-427-1201.",
            "tickers": [
                "hdb"
            ],
            "img" : "https://th.bing.com/th?id=OIF.pcIyVxQklTXNYJ%2bSgWbJpA&w=276&h=203&c=7&r=0&o=5&dpr=1.1&pid=1.7"
        },
        {
            "id": "5885018425736034375",
            "title": "Can you get cash back from a credit card?",
            "url": "https://thepointsguy.com/guide/how-to-get-cash-back-from-credit-card/",
            "site": "thepointsguy.com",
            "time": 1700582433000,
            "favicon_url": "https://static.tickertick.com/website_icons/thepointsguy.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Credit card rewards are derived from spending on credit cards and can take several forms, such as points with a bank or miles with a specific airline. A popular credit card reward is “cash back,” giving you a portion of your money back from purchases. Cash-back reward structures vary from card to card, with some … Credit card rewards are derived from spending on credit cards and can take several forms, such as points with a bank or miles with a specific airline. A popular credit card reward is “cash back,” giving you a portion of your money back from purchases. Cash-back reward structures vary from card to card, with some offering a fixed cash-back rate and others incentivizing spending in bonus categories, including at specific times of the year. It’s important to understand how cash-back credit cards work and the best ways to earn and redeem rewards to get the most bang for your buck when using the right card. Let’s explore if you can get cash back from a credit card and how to do so. Can you get cash back from a credit card? Yes, you can. A cash-back card allows cardholders to accrue rewards with every purchase made using the card. Cardholders who accrue rewards can redeem the cash back as a check, a statement credit for the respective credit card, or as a deposit into a bank account. Some cards may offer a simple 2% cash back on all purchases, while others can offer increased earning rates on specific categories, such as 5% back on gas and 3% at restaurants. OLEG BRESLAVTSEV/GETTY IMAGES Related: Choosing a cash-back credit card How to get cash back from a credit card With so many credit cards offering cash back, it can be hard to navigate how to get cash back and earn rewards across different spending categories. Flat-rate rewards Some cards, such as the Capital One Quicksilver Cash Rewards Credit Card, offer a flat rate on eligible purchases. This card offers unlimited 1.5% cash back on all purchases. The simple cash-back earning and easy-to-track rewards of this card and other flat-rate rewards cards are ideal for those seeking a simple method of getting cash back from a credit card. Rotating rewards The rotating category is a popular reward structure for cash-back cards. These cards split earning categories across quarters or specific time periods. Take, for example, the Chase Freedom Flex, which offers 5% cash back on up to $1,500 on combined purchases in bonus categories you activate each quarter. In the fourth quarter of 2023, the Freedom Flex offers 5% cash back on purchases made with PayPal, wholesale clubs and charities. In addition to rotating rewards, the Freedom Flex also earns 5% cash back on travel purchased through Chase; 3% on dining, including takeout, and at drugstores; and 1% on all other purchases. THE POINTS GUY Another card that offers rotating categories is the Discover it Cash Back, which earns 5% cash back on purchases at different places each quarter, on up to a quarterly maximum of $1,500 when activated, in addition to unlimited 1% cash back on all other purchases. It’s important to note that cardholders only earn in quarterly bonus categories when they activate the offer each quarter and will not earn cash back in those categories over the maximum cap of $1,500 in purchases. Tiered rewards Cash-back cards with tiered rewards offer a complex earning structure across various categories. For example, the popular Chase Freedom Unlimited earns cash back at the following rates: 3% on dining at restaurants (including takeout and eligible delivery services), 3% on drugstore purchases, 5% on travel purchased through the Chase Ultimate Rewards travel portal, and 1.5% on all other purchases. Cash back earned on this card can be redeemed as a statement credit, check or bank deposit, or as travel booked through Chase Ultimate Rewards. ERIC ROSEN/THE POINTS GUY Although this card offers a variety of bonus categories to earn rewards with, its lowest category earning, 1.5%, aims to help customers be rewarded over the usual 1% earning with many other cash-back credit cards. Other structures Some credit cards can take a unique approach to earning cash-back rewards. A great example is the Citi Custom Cash® Card (see rates and fees): The bonus-earning categories change based on spending habits. Cardholders earn 5% cash back on purchases in their top eligible spending category each billing cycle, on up to $500 monthly, and then 1% cash back on all other purchases. Cash back vs. cash advance “Cash back” refers to a percentage of the purchase amount returned to the customer, often offered by credit cards or retailers as an incentive to spend. On the other hand, a cash advance involves borrowing money from a credit card or financial institution, typically with high interest rates and fees. How to redeem cash-back rewards Redeeming cash back varies from issuer to issuer. However, it usually starts with logging in to your credit card account via the issuer’s website or mobile application. From there, you can choose to receive your rewards as a statement credit, a deposit to a qualifying bank account or a check mailed to you. Some cards automatically apply cash back as a statement credit. Additional options include redeeming cash back for gift cards or shopping with select retailers. WESTEND61/GETTY IMAGES Some cards earn points instead of cash back. If you hold other cards within the same credit card family, such as the Chase Trifecta, you can transfer points to more powerful credit cards, which can be leveraged for travel by transferring those points to a loyalty partner. Bottom line Getting cash back from credit cards is possible, and earning is based on different reward structures that yield greater cash back on bonus category spending. Based on your expenses and existing cards within your wallet, opening a cash-back credit card from the same issuer or a card that offers a good return based on spending habits may make sense. Cash-back rewards can be redeemed for statement credits or deposited into a bank account — but if you hold travel rewards cards, they can be leveraged to help fund travel, giving you greater value. Related: How to choose a cash-back credit card",
            "tickers": [
                "hdb"
            ]
        },
        {
            "id": "-7523345238279477746",
            "title": "Best Unsecured Credit Cards Of November 2023",
            "url": "https://www.forbes.com/advisor/credit-cards/best/unsecured/",
            "site": "forbes.com",
            "time": 1700575213000,
            "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Most credit cards are unsecured, meaning you don’t need to put up a security deposit to get approved. Whether your credit is in great shape or needs a bit of work, these top unsecured credit cards can offer significant value with rewards on your everyday purchases and other benefits. Most credit cards are unsecured, meaning you don’t need to put up a security deposit to get approved. Whether your credit is in great shape or needs a bit of work, these top unsecured credit cards can offer significant value with rewards on your everyday purchases and other benefits.",
            "tickers": [
                "hdb"
            ],
            "img" : "https://th.bing.com/th/id/OIP.b5vipEOdbPxSAg395hJ37gHaFT?w=218&h=180&c=7&r=0&o=5&dpr=1.1&pid=1.7"
        },
        {
            "id": "-4588634795193570527",
            "title": "I Owe Money on My Credit Cards. Is There Any Way to Pay Them Off by the End of the Year?",
            "url": "https://www.fool.com/the-ascent/credit-cards/articles/i-owe-money-on-my-credit-cards-is-there-any-way-to-pay-them-off-by-the-end-of-the-year/?source=askdougpancakes&utm_source=chromefollow&utm_medium=feed&utm_campaign=news",
            "site": "fool.com",
            "time": 1700571628000,
            "favicon_url": "https://static.tickertick.com/website_icons/fool.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Want to ditch your debt in time for 2024? Read on to see if it's feasible and how you might pull that off. Image source: Getty Images If you're carrying a balance on your credit cards, rest assured that you're not alone. As of the third quarter of 2023, U.S. credit card balances were at $995 billion, according to TransUnion. And they also rose 15% from a year prior. This tells us that a lot of people clearly needed to borrow via their credit cards for different reasons over roughly the past 12 months.Now, perhaps you ran into credit card debt because you encountered a home or car repair and didn't have enough money in your emergency fund to cover it. Or maybe you just lost track of your spending at one point during the year. Hey, it happens.Either way, you may be eager to shed your credit card debt by the end of the year so you can start off 2024 with a clean slate. Whether that's doable, though, will depend on how much debt you have.It's important to be realistic about your credit card debtIf you're an average earner with a $5,000 credit card balance, then chances are, it's not going to be gone by Dec. 31. And it's important to accept that.You don't want to put undue pressure on yourself and ruin the holiday season for no good reason. So if your debt load is large enough, set a more realistic goal -- say, paying it off by the end of 2024. Featured offer: save money while you pay off debt with one of these top-rated balance transfer credit cards However, it may be that you owe a smaller sum on your credit cards -- say, $500 or $800. It may be more feasible to pay off a balance of that size in about a month with the right approach.If you don't think your credit cards can be paid off in full by the end of the year, then you may want to consider ways to consolidate your debt and make it less expensive to pay off. One option is to do a balance transfer to a new card with a 0% introductory APR. Another option is to consolidate your debt into a personal loan, where you'll benefit from a fixed interest rate (and, most likely, a lower interest rate than what your credit cards are currently charging you).The gig economy could bail you outMaybe you owe an amount on your credit cards that's reasonable to pay off by the end of the year with the right amount of effort. In that case, joining the gig economy could be your ticket to knocking it out in about a month's time.Many local retailers are all staffed up for the holiday season at this point. But you might still manage to find a local business that needs more help.You can also consider gigs like pet-sitting, since many people tend to travel during the holidays and therefore might need the help. And if you live near an airport, December could be a good month to drive for a ride-hailing service, as there might be strong demand.Paying off a moderate amount of credit card debt by the end of the year may be feasible. But if you have a larger balance, be realistic.And rather than get down about carrying debt into 2024, map out a solid plan to get it paid off. Having a game plan could help you feel better about your situation, since you'll know there's a light at the end of the tunnel.Alert: highest cash back card we've seen now has 0% intro APR until 2025If you're using the wrong credit or debit card, it could be costing you serious money. Our experts love this top pick, which features a 0% intro APR for 15 months, an insane cash back rate of up to 5%, and all somehow for no annual fee. In fact, this card is so good that our experts even use it personally. Click here to read our full review for free and apply in just 2 minutes. Read our free reviewWe're firm believers in the Golden Rule, which is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. The Ascent does not cover all offers on the market. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.The Motley Fool has a disclosure policy.",
            "tickers": [
                "hdb"
            ]
        },
        {
            "id": "-3596315926534814995",
            "title": "181,283 Shares in HDFC Bank Limited (NYSE:HDB) Purchased by Rhumbline Advisers",
            "url": "https://www.marketbeat.com/instant-alerts/nyse-hdb-sec-filing-2023-11-21/",
            "site": "marketbeat.com",
            "time": 1700561699000,
            "favicon_url": "https://static.tickertick.com/website_icons/marketbeat.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "Rhumbline Advisers acquired a new position in shares of HDFC Bank Limited (NYSE:HDB - Free Report) in the second quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The firm acquired 181,283 shares of the bank's stock, valued at approxi",
            "tickers": [
                "hdb"
            ]
        },
        {
            "id": "5774261414369319722",
            "title": "Credit-Seeking Consumers Give Credit Unions and Community Banks a Second Look",
            "url": "https://www.pymnts.com/credit-unions/2023/credit-seeking-consumers-give-credit-unions-and-community-banks-a-second-look/",
            "site": "pymnts.com",
            "time": 1700557278000,
            "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "National banks dominate the consumer credit space. Still, credit unions and community banks are becoming an increasingly popular choice for issuing credit cards. The share of consumers with a CU or community bank card as their primary card rose from 8.3% in 2020 to 13% in 2023. Moreover, 24% of consumers said they would likely […] The post Credit-Seeking Consumers Give Credit Unions and Community Banks a Second Look first appeared on PYMNTS.com. National banks dominate the consumer credit space. Still, credit unions and community banks are becoming an increasingly popular choice for issuing credit cards. The share of consumers with a CU or community bank card as their primary card rose from 8.3% in 2020 to 13% in 2023. Moreover, 24% of consumers said they would likely turn to these financial institutions for their next credit application. CUs and community banks can improve their appeal by offering the key features national bank cardholders value. These include rewards and cash back programs, the ability to split payments and adjustable spending limits. These are just some of the findings detailed in “Credit Unions and Community Banks Gain Credit Card Issuing Momentum,” a PYMNTS Intelligence and Elan Credit Card collaboration. The report examines the current state of play for consumer credit cards. It draws on insights from a survey conducted from Aug. 10 to Aug. 21 of 2,088 United States consumers to explore their evolving preferences surrounding card issuers. Other findings from the study follow. National banks issue the most primary consumer credit cards, especially to consumers who also bank with them. Among U.S. adults with an actively used card, 68% reported that a national bank issued their primary card — the one they used the most. Other categories of FIs accounted for less than 10% each: 8.3% of cardholders had their primary card with CUs; 8.3% with regional banks; 5.1% with community banks; and 3.9% with digital-only banks. Although these percentages were relatively low, the shares of consumers with credit cards issued by these FIs have increased since 2020. CUs and community banks struggle to attract high-spending non-revolvers to credit card options. Just 8.7% of high-spending non-revolvers — a lucrative segment that spends heavily but does not usually carry a balance — said they would most likely choose a CU when applying for a new card. A mere 5.4% of this group said the same for community banks. CUs and community banks can win a sizable share of national bank cardholders by offering key credit card features. More than one-third of national bank cardholders would be highly likely to switch if smaller FIs offered the right features. Rewards and cash back programs represent the most impactful benefit overall, as 81% of national bank cardholders cited these as important, and 37% of this group would be highly likely to switch to a CU or community bank that provides cards with this feature. Other high-impact benefits include account alerts, autopay and websites and apps for monitoring balances and making payments. To compete with national banks and expand market shares in consumer credit cards, CUs and community banks must focus on the features cardholders value. Download the report to learn how CUs and community banks can strategically leverage consumer interest to increase credit card users.The post Credit-Seeking Consumers Give Credit Unions and Community Banks a Second Look first appeared on PYMNTS.com.",
            "tickers": [
                "hdb"
            ]
        },
        {
            "id": "-7438376603617238258",
            "title": "Fintech startup Kiwi raises $13mn in Series A led by Omidyar",
            "url": "https://www.livemint.com/companies/start-ups/fintech-startup-kiwi-raises-13mn-in-series-a-led-by-omidyar-11700546293991.html",
            "site": "livemint.com",
            "time": 1700546732000,
            "favicon_url": "https://static.tickertick.com/website_icons/livemint.com.ico",
            "tags": [
                "hdb"
            ],
            "description": "This funding will enable Kiwi to further expand its ‘credit cards on UPI’ offerings in India.",
            "tickers": [
                "hdb"
            ]
        }
    ],
    "last_id": "-7438376603617238258"
}