{
    "stories": [
        {
            "id": "-1254568366163515118",
            "title": "MayTech Global Investments LLC Grows Stock Holdings in MakeMyTrip Limited (NASDAQ:MMYT)",
            "url": "https://www.etfdailynews.com/2023/11/20/maytech-global-investments-llc-grows-stock-holdings-in-makemytrip-limited-nasdaqmmyt/",
            "site": "etfdailynews.com",
            "time": 1700496525000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MayTech Global Investments LLC grew its stake in MakeMyTrip Limited (NASDAQ:MMYT – Free Report) by 17.9% in the second quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The institutional investor owned 193,605 shares of the technology company’s stock after purchasing an additional 29,461 shares during the period. MakeMyTrip makes […]",
            "tickers": [
                "mmyt"
            ],
            "img" : "https://www.marketbeat.com/logos/makemytrip-limited-logo.png?v=20221121151245"
        },
        {
            "id": "-1888528788497068409",
            "title": "MayTech Global Investments LLC Raises Holdings in MakeMyTrip Limited (NASDAQ:MMYT)",
            "url": "https://www.tickerreport.com/banking-finance/11361343/maytech-global-investments-llc-raises-holdings-in-makemytrip-limited-nasdaqmmyt.html",
            "site": "tickerreport.com",
            "time": 1700496522000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MayTech Global Investments LLC raised its stake in shares of MakeMyTrip Limited (NASDAQ:MMYT – Free Report) by 17.9% during the second quarter, Holdings Channel.com reports. The institutional investor owned 193,605 shares of the technology company’s stock after buying an additional 29,461 shares during the period. MakeMyTrip accounts for about 1.0% of MayTech Global Investments LLC’s […]",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-2511716451870919495",
            "title": "Blog Post: Day 11 of $QQQ short term up-trend; 5 stocks that reached an ATH on Friday and passed the Weekly Green Bar setup: $ACLX, $APG, $MMYT, $QLYS, $ENSG",
            "url": "https://www.wishingwealthblog.com/2023/11/blog-post-day-11-of-qqq-short-term-up-trend-5-stocks-that-reached-an-ath-on-friday-and-passed-the-weekly-green-bar-setup-aclx-apg-mmyt-qlys-ensg/",
            "site": "wishingwealthblog.com",
            "time": 1700444939000,
            "tags": [
                "mmyt"
            ],
            "description": "IndicatorsGMI: 5/6GMI-2: 7/9T2108: 61%The GMI remains Green. The post Blog Post: Day 11 of $QQQ short term up-trend; 5 stocks that reached an ATH on Friday and passed the Weekly Green Bar setup: $ACLX, $APG, $MMYT, $QLYS, $ENSG first appeared on Wishing Wealth Blog. IndicatorsGMI: 5/6GMI-2: 7/9T2108: 61%The GMI remains Green. The post Blog Post: Day 11 of $QQQ short term up-trend; 5 stocks that reached an ATH on Friday and passed the Weekly Green Bar setup: $ACLX, $APG, $MMYT, $QLYS, $ENSG first appeared on Wishing Wealth Blog.",
            "tickers": [
                "mmyt"
            ],
            "img" : "https://www.wishingwealthblog.com/wp-content/uploads/2023/11/Screenshot-2023-11-20-at-11.03.43-PM.jpg"
        },
        {
            "id": "-5496475194634019495",
            "title": "MakeMyTrip (NASDAQ:MMYT) Sets New 12-Month High at $43.14",
            "url": "https://www.tickerreport.com/banking-finance/11350734/makemytrip-nasdaqmmyt-sets-new-12-month-high-at-43-14.html",
            "site": "tickerreport.com",
            "time": 1700232641000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MakeMyTrip Limited (NASDAQ:MMYT – Get Free Report) reached a new 52-week high during trading on Wednesday . The company traded as high as $43.14 and last traded at $42.97, with a volume of 101926 shares. The stock had previously closed at $42.42. Wall Street Analyst Weigh In Several equities analysts have weighed in on the […]",
            "tickers": [
                "mmyt"
            ],
            "img" : "https://www.marketbeat.com/logos/articles/med_20231114071230_tripadvisor-is-on-ai-powered-recovery-from-record.jpg"
        },
        {
            "id": "-5360470086907578014",
            "title": "MakeMyTrip Ltd: Form 144 - Report of proposed sale of securities",
            "url": "https://www.sec.gov/Archives/edgar/data/1495153/000195004723005019/0001950047-23-005019-index.htm",
            "site": "sec.gov",
            "time": 1700083016000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "mmyt"
            ],
            "tickers": [
                "mmyt"
            ],
            "img" : "https://th.bing.com/th/id/OIP.khJDJm0TtL_Cl-XWLXCvtQHaEK?w=323&h=180&c=7&r=0&o=5&dpr=1.1&pid=1.7"
        },
        
        
        {
            "id": "2236380837200484915",
            "title": "What to know about MakeMyTrip Ltd (MMYT)’s sales and margins",
            "url": "https://mzpnews.com/2023/11/10/what-to-know-about-makemytrip-ltd-mmyts-sales-and-margins/",
            "site": "mzpnews.com",
            "time": 1699631640000,
            "favicon_url": "https://static.tickertick.com/website_icons/mzpnews.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "Currently, MakeMyTrip Ltd [MMYT] is trading at $40.49, up 2.29%. It is a good measure of the stock’s recent performance to check whether the stock’s short-term value is rising or falling. The MMYT shares have gain 4.34% over the last week, with a monthly amount drifted -4.61%, and not seem to be holding up well […] The post What to know about MakeMyTrip Ltd (MMYT)’s sales and margins first appeared on MZP News. Currently, MakeMyTrip Ltd [MMYT] is trading at $40.49, up 2.29%. It is a good measure of the stock’s recent performance to check whether the stock’s short-term value is rising or falling. The MMYT shares have gain 4.34% over the last week, with a monthly amount drifted -4.61%, and not seem to be holding up well over a long-time horizon. On 21, October 2023, MakeMyTrip Limited to report Fiscal 2024 Second Quarter Financial & Operating Results on October 31, 2023. In a post published today on Yahoo Finance, MakeMyTrip Limited (Nasdaq: MMYT) plans to report its fiscal 2024 second quarter financial and operating results before markets open on Tuesday, October 31, 2023. The company will post the release on its Investor Relations website ",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "-589337911426592474",
            "title": "MakeMyTrip swings to profit, to acquire Savaari Car Rentals",
            "url": "https://economictimes.indiatimes.com/industry/services/travel/makemytrip-swings-to-profit-to-acquire-savaari-car-rentals/articleshow/104861970.cms",
            "site": "indiatimes.com",
            "time": 1698763980000,
            "favicon_url": "https://static.tickertick.com/website_icons/indiatimes.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "MakeMyTrip, a Nasdaq-listed company, has agreed to acquire a majority stake in Savaari Car Rentals Private Limited, a provider of inter-city car rental services in India. The transaction is set to be finalized by December 31, 2023, as the company aims to bolster its presence in the Indian inter-city car rental market. In its Q2 2024 results, MakeMyTrip reported gross bookings of $1.8 billion, marking a 24% year-on-year increase, with a profit of $2 million compared to a loss of $6.8 million in the same period the previous year.",
            "tickers": [
                "mmyt"
            ],
            "img": "https://img.etimg.com/thumb/msid-104862023,width-300,height-225,imgsize-42210,,resizemode-75/makemytrip-.jpg"
        },
        {
            "id": "7917043910604455765",
            "title": "MakeMyTrip makes gains across air ticketing, hotels as travel demand remains high",
            "url": "https://www.phocuswire.com/makemytrip-q2-2024",
            "site": "phocuswire.com",
            "time": 1698760500000,
            "favicon_url": "https://static.tickertick.com/website_icons/phocuswire.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "The Gurugram, India-based business attributed its revenue gains for the quarter to elevated travel demand.",
            "tickers": [
                "mmyt"
            ]
        },
        {
            "id": "3492578857530011282",
            "title": "MakeMyTrip In The Black In Q2, Posts Net Profit Of $2 Mn",
            "url": "https://inc42.com/buzz/makemytrip-in-the-black-in-q2-posts-net-profit-of-2-mn/",
            "site": "inc42.com",
            "time": 1698755519000,
            "favicon_url": "https://static.tickertick.com/website_icons/inc42.com.ico",
            "tags": [
                "mmyt"
            ],
            "description": "Nasdaq-listed Indian traveltech company MakeMyTrip posted a net profit of $2 Mn in the September quarter (Q2) of the financial… Nasdaq-listed Indian traveltech company MakeMyTrip posted a net profit of $2 Mn in the September quarter (Q2) of the financial year 2023-24 (FY24) as against a loss of $6.8 Mn reported last year. However, on a sequential basis, the company’s net profit nosedived from $18.6 Mn in the previous quarter – Q1 FY24, which the company attributed to the seasonality factors. MakeMyTrip’s revenue jumped 28.5% to $168.7 Mn during the quarter under review as against $131.3 Mn reported in Q2 FY23. The company had generated a revenue of $196.7 Mn in Q1 FY24. “While the second quarter of fiscal year tends to be a seasonally weaker period for leisure travel, we are pleased to report strong year-on-year revenue growth and expansion in adjusted operating profit,” said Rajesh Magow, group CEO of MakeMyTrip. “Our innovative travel solutions, brand strength and ability to deliver superior value to our customers and our partners are helping us to drive profitable growth,” he added. MakeMyTrip generated $48.6 Mn in revenue from its air ticketing business, which increased 22.7% year-on-year (YoY). Meanwhile, revenue from its hotels and packages business jumped 30.9% YoY to $89.4 Mn in the quarter under review. Its bus ticketing business generated $19.8 Mn in revenue in Q2 FY24, up 23% YoY. MakeMyTrip’s gross bookings increased 23.8% YoY to $1,839.7 Mn in Q2 FY24 but it was a decline from $1,987.5 Mn in gross bookings witnessed in Q1. MakeMyTrip’s expenses increased YoY during Q2 FY24. Its personnel expenses increased by 4.6% to $35 Mn in the quarter from $33.5 Mn the prior year’s quarter, primarily due to annual wage increases, said the company. Meanwhile, service cost jumped 24.8% YoY to $40.3 Mn in Q2 FY24. The company attributed this increase primarily to the sustained elevated travel demand in India. The traveltech major’s other operating expenses rose 69.4% YoY to $55.1 Mn in Q2, primarily due to a $12.6 Mn increase in operating expenses, including distribution costs, payment gateway charges, outsourcing fees and website hosting charges linked to the increase in bookings. MakeMyTrip said that a $10 Mn impairment provision towards recoverable from Go Airlines also led to this rise. However, it managed to keep its marketing and sales promotion almost flat at $25 Mn in the quarter under review as against $24.8 Mn in Q2 FY23. The post MakeMyTrip In The Black In Q2, Posts Net Profit Of $2 Mn appeared first on Inc42 Media.",
            "tickers": [
                "mmyt"
            ]
        }
    ],
    "last_id": "3492578857530011282"
}