{
    "stories": [
        {
            "id": "5534335600188544603",
            "title": "See How Many Tesla Superchargers Each State Has",
            "url": "https://247wallst.com/autos/2023/11/20/this-how-many-tesla-superchargers-in-each-state/",
            "site": "247wallst.com",
            "time": 1700508791000,
            "favicon_url": "https://static.tickertick.com/website_icons/247wallst.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Ten years ago, Tesla (NASDAQ: TSLA) had only 30 Supercharger stations in the United States. Only the Interstate 5 highway along the west coast had a reliable long-distance chain of these quick-charge stations. How many Tesla Superchargers are there in every US state? Today, there are nearly 2,000 of Tesla’s fast-charging stations with more than […] The post See How Many Tesla Superchargers Each State Has appeared first on 24/7 Wall St.. Ten years ago, Tesla (NASDAQ: TSLA) had only 30 Supercharger stations in the United States. Only the Interstate 5 highway along the west coast had a reliable long-distance chain of these quick-charge stations. How many Tesla Superchargers are there in every US state? Today, there are nearly 2,000 of Tesla’s fast-charging stations with more than 22,000 charging ports in the U.S. As recently as Oct. 18, several more stations – from densely populated Florida to the wide expanse of Montana – were added to the U.S. Department of Energy’s Alternative Fuels Data Center. What a difference a decade makes. Tesla Supercharger network opens up Tesla’s Supercharger network is so ahead of the game that it’s in the process of opening its network to other electric car models produced by companies like Ford (NYSE: F) and Rivian (NASDAQ: RIVN). California, Texas, and Florida, have about a third of Tesla Supercharger stations and 42% of all ports. More than half of the network is in the ten most populated states. How many Tesla Supercharger are there in a state shows that Tesla is prioritizing some states over others. Some states are falling behind For instance, Nevada, with a population of 3.1 million people, has 36 Tesla Supercharger stations while Oklahoma with a population of nearly 4 million has only six of them. Because of Nevada’s proximity to California, Tesla’s largest market, it makes sense for Tesla to prioritize it. Oklahoma, which in 2020 lost its bid to Texas for the first Tesla Cybertruck plant, has been slow to embrace EVs or alternative-fuel infrastructure. “When it comes to electric vehicles on the road, Oklahoma has catching up to do,” wrote the Oklahoman newspaper in May. States with fewer than 10 Tesla Superchargers Eleven states and the District of Columbia have fewer than 10 Tesla Supercharger stations. Out of the 10 largest states by population, Michigan has the fewest number of Supercharger stations to quickly charge a Tesla inside the company’s network. The home to the big three U.S. Automakers has only 34 Tesla Supercharger stations, just two more than Wisconsin, which has a much smaller population. Here are the number of Superchargers in each U.S. state: Alabama Number of Superchargers: 19 Number of ports: 206 Alaska Number of Superchargers: 2 Number of ports: 12 Arizona Number of Superchargers: 43 Number of ports: 682 Arkansas Number of Superchargers: 7 Number of ports: 63 California Number of Superchargers: 396 Number of ports: 6,155 Colorado Number of Superchargers: 37 Number of ports: 364 Connecticut Number of Superchargers: 31 Number of ports: 288 Delaware Number of Superchargers: 15 Number of ports: 132 District of Columbia Number of Superchargers: 3 Number of ports: 28 Florida Number of Superchargers: 145 Number of ports: 1,472 Georgia Number of Superchargers: 45 Number of ports: 528 Hawaii Number of Superchargers: 1 Number of ports: 6 Idaho Number of Superchargers: 7 Number of ports: 62 Illinois Number of Superchargers: 55 Number of ports: 630 Indiana Number of Superchargers: 34 Number of ports: 337 Iowa Number of Superchargers: 17 Number of ports: 138 Kansas Number of Superchargers: 16 Number of ports: 138 Kentucky Number of Superchargers: 12 Number of ports: 130 Louisiana Number of Superchargers: 17 Number of ports: 167 Maine Number of Superchargers: 18 Number of ports: 144 Maryland Number of Superchargers: 52 Number of ports: 447 Massachusetts Number of Superchargers: 46 Number of ports: 448 Michigan Number of Superchargers: 34 Number of ports: 314 Minnesota Number of Superchargers: 29 Number of ports: 252 Mississippi Number of Superchargers: 9 Number of ports: 80 Missouri Number of Superchargers: 23 Number of ports: 195 Montana Number of Superchargers: 17 Number of ports: 124 Nebraska Number of Superchargers: 9 Number of ports: 76 Nevada Number of Superchargers: 36 Number of ports: 422 New Hampshire Number of Superchargers: 13 Number of ports: 118 New Jersey Number of Superchargers: 70 Number of ports: 688 New Mexico Number of Superchargers: 14 Number of ports: 115 New York Number of Superchargers: 83 Number of ports: 770 North Carolina Number of Superchargers: 61 Number of ports: 643 North Dakota Number of Superchargers: 5 Number of ports: 40 Ohio Number of Superchargers: 38 Number of ports: 357 Oklahoma Number of Superchargers: 6 Number of ports: 60 Oregon Number of Superchargers: 40 Number of ports: 422 Pennsylvania Number of Superchargers: 72 Number of ports: 642 Rhode Island Number of Superchargers: 5 Number of ports: 40 South Carolina Number of Superchargers: 30 Number of ports: 340 South Dakota Number of Superchargers: 10 Number of ports: 68 Tennessee Number of Superchargers: 24 Number of ports: 275 Texas Number of Superchargers: 138 Number of ports: 1,579 Utah Number of Superchargers: 22 Number of ports: 202 Vermont Number of Superchargers: 6 Number of ports: 54 Virginia Number of Superchargers: 66 Number of ports: 587 Washington Number of Superchargers: 50 Number of ports: 523 West Virginia Number of Superchargers: 15 Number of ports: 114 Wisconsin Number of Superchargers: 32 Number of ports: 275 Wyoming Number of Superchargers: 11 Number of ports: 72 Sponsored: Tips for Investing A financial advisor can help you understand the advantages and disadvantages of investment properties. Finding a qualified financial advisor doesn’t have to be hard. SmartAsset’s free tool matches you with up to three financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you. If you’re ready to find an advisor who can help you achieve your financial goals, get started now. Investing in real estate can diversify your portfolio. But expanding your horizons may add additional costs. If you’re an investor looking to minimize expenses, consider checking out online brokerages. They often offer low investment fees, helping you maximize your profit. The post See How Many Tesla Superchargers Each State Has appeared first on 24/7 Wall St..",
            "tickers": [
                "tsla"
            ],
            "img" : "https://247wallst.com/wp-content/uploads/2021/07/imageForEntry25-xcv.jpg"
        },
        {
            "id": "-4958505081614061086",
            "title": "Tesla Signage Reveals Cybertruck Details: Will It Live Up To Lofty Expectations?",
            "url": "https://www.benzinga.com/news/23/11/35879991/tesla-signage-reveals-cybertruck-details-will-it-live-up-to-lofty-expectations",
            "site": "benzinga.com",
            "time": 1700508555000,
            "favicon_url": "https://static.tickertick.com/website_icons/benzinga.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Tesla Inc's (NASDAQ: TSLA) latest advertising efforts are setting high expectations for the upcoming Cybertruck, as seen in a new advertisement at their read more",
            "tickers": [
                "tsla"
            ]
        },
        {
            "id": "-3342981704956306646",
            "title": ": Biden administration isn’t ending U.S. reliance on Elon Musk’s SpaceX, White House says",
            "url": "http://www.marketwatch.com/news/story/biden-administration-isnt-ending-us/story.aspx?guid=%7B20C06575%2D04D4%2DB545%2D729E%2DA1801D8A723B%7D&siteid=nf-rss",
            "site": "marketwatch.com",
            "time": 1700508000000,
            "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "White House spokesman John Kirby on Monday told reporters that’s he’s “not aware” of any Biden administration efforts to wean the U.S. government off SpaceX’s technology in response to founder Elon Musk’s apparent endorsement of antisemitic rhetoric. “There’s innovation out there in the private sector that we’d be foolish to walk away from,” Kirby told reporters during a press briefing. “I’m not aware of any specific efforts to address our concerns over his rhetoric through the way that his companies provide support to our national-security establishment, but that doesn’t mean that we accept or agree with or condone in any way that antisemitic rhetoric that he pushed.” In addition, White House press secretary Karine Jean-Pierre said she didn’t ’have “anything to announce at this time” when she was asked about whether the White House’s or President Joe Biden’s accounts on Musk’s X platform would be suspended.",
            "tickers": [
                "tsla"
            ],
            "img" : "https://th.bing.com/th/id/OIF.iy8m4wjJhkv5Ou3auwecyQ?rs=1&pid=ImgDetMain"
        },
        {
            "id": "6997663693234214641",
            "title": "Meet OpenAI cofounder Ilya Sutskever. He supported, then regretted ousting Sam Altman",
            "url": "https://www.businessinsider.com/meet-openai-cofounder-ilya-sutskever-supported-regretted-sam-altman-firing-2023-11",
            "site": "businessinsider.com",
            "time": 1700507664000,
            "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "OpenAI's chief scientist Ilya Sutskever was recruited to the company by Elon Musk and later helped lead the ousting of cofounder Sam Altman. Ilya Sutskever now says he regrets his role in arranging the ouster of now-former OpenAI CEO Sam Altman.AMIR COHEN/ReutersIlya Sutskever, chief scientist at OpenAI, has apologized for his role in Sam Altman's ousting.Sutskever and Altman co-founded OpenAI in 2016 with the help of Elon Musk.He has worked for some of the most prominent names in artificial intelligence for the last decade.OpenAI's Ilya Sutskever — who cofounded OpenAI with Sam Altman in 2015 — played a role in kicking the now-former CEO out of the company.The chief scientist is a member of the board that made the decision to fire Altman. The board had said that it \"no longer has confidence\" in Altman's ability to lead OpenAI, and said that he was \"not consistently candid in his communications.\"But a few days later, Sutskever expressed his remorse for being involved in ousting Altman. And he's now one of more than 600 OpenAI employees who signed an open letter threatening to quit unless the board resigns and re-appointes Altman as CEO. \"I deeply regret my participation in the board's actions,\" Sutskever said in an X post. \"I never intended to harm OpenAI.\"Here's how Sutskever went from working at Google to a leading role at OpenAI.Ilya Sutskever was born in Soviet-era Russia in 1986.Sutskever spent the first five years of his life in Russia. He's now 37.Galen Rowell/Getty ImagesThe 37-year-old was born in Russia, and spent the first five years of his life there. As a result he speaks Russian — as well as Hebrew and English, according to a conversation he had for MIT Technology Review.His family moved to Jerusalem when Sutskever was 5 years old.Sutskever moved to Israel from Russia when he was just 5.Nick Brundle Photography/Getty ImagesSutskever was raised in Jerusalem as a child up until he left the country to pursue computer science at the University of Toronto. While in Canada, Sutskever worked in the Machine Learning Group on campus with one of AI's most prominent figures, Fast Company reported.He studied with a \"godfather of AI\" as a graduate student at the University of Toronto.Computer scientist and Google Brain Vice President Geoffrey Hinton, who's known as a \"godfather of AI.\"Noah Berger/Associated PressSutskever worked under Geoffrey Hinton, known as a godfather of AI by some, on neural networks. Along with fellow grad student Alex Krizhevksy, Sutskever worked on the Hinton-led startup DNNresearch.Sutskever, Krizhevsky, and Hinton authored the famous ImageNet white paper in 2012.Sutskever coauthored a deep -learning paper in 2012 that was seen as a game-changer in AI. Alex Krizhevsky, Ilya Sutskever, Geoffrey E. HintonThe white paper co-authored by Sutskever is considered partly responsible for the \"launch of the deep-learning revolution,\" according to a 2020 interview with Lex Fridman.He began working at Google in 2013 after the company purchased his start-up.Sutskever worked at Google for years before helping to found OpenAI.Artur Widak/NurPhoto via Getty ImagesGoogle bought DNNresearch in 2013, and Sutskever and Krizhevsky began living California while Hinton stayed behind in Toronto, BI previously reported.About three months before the acquisition, Sutskever spent one month as a postdoc at Standford University before returning to Canada.After DNNresearch was sold, Sutskever worked on Google's Brain Team for nearly three years before Elon Musk came calling, according to Fast Company.Elon Musk said he had a tough time recruiting Sutskever to cofound OpenAI.Elon Musk convinced Sutskever to join the founding team of OpenAI. Chesnot via Getty ImagesWhile he was at Google, Sutskever was courted by Musk to join the founding team of OpenAI.In an interview with CNBC, Musk referred to Sutskever as the \"linchpin\" of OpenAI's success. But it took some convincing to get him to leave Google, Musk said.At the end of 2015, Ilya Sutskever cofounded OpenAI with ex-CEO Sam Altman Sutskever cofounded OpenAi with Sam Altman in 2015.JACK GUEZOpenAI, started as a research non-profit, aimed to develop artificial intelligence that would benefit humanity in a way that's \"unconstrained by a need to generate financial return,\" according to the company's 2015 blog post.In 2016, OpenAI developed the first of its large language models — which would later power ChatGPT.OpenAI developed its generative AI language models under Sutskever's leadership. Justin Sullivan/GettyUnder Sutskever's leadership, OpenAI developed the early versions of GPT, the models behind AI chatbot ChatGPT, and DALL-E, a model behind its text-to-image generator.Sutskever said he spends the bulk of his days working. Sutskever said he leads a simple life of working and then going home. JACK GUEZ/Getty Images\"I lead a very simple life,\" the OpenAI cofounder told the MIT Technology Review. \"I go to work; then I go home. I don't do much else. There are a lot of social activities one could engage in, lots of events one could go to. Which I don't.\"Sutskever thought ChatGPT would be a flop when OpenAI launched the AI chatbot in November 2022. Sutskever said he wasn't confident ChatGPT would be successful. FLORENCE LO/Reuters\"When we made ChatGPT, I didn't know if it was any good,\" Sutskever told the MIT Tech Review. \"I thought it was going to be so unimpressive that people would say, 'Why are you doing this? This is so boring!'\"ChatGPT reached over 100 million users within two months of its launch.Sutskever has always been vocal about the belief that AGI, or artificial general intelligence, is on the horizon. Sutskever has sounded the alarm around the development of AGI. JACK GUEZ/Getty ImagesSutskever said that AI will have the power to solve issues related to employment, disease and poverty, he told The Guardian. At the same time, he said that AI will create new problems such as a surge in fake news and cyberattacks, automated AI weapons, and even \"infinitely stable dictatorships.\"So-called artificial general intelligence, or AGI, is at the heart of this technology. \"These models are very potent and they're becoming more and more potent,\" he said in March regarding AI models. \"At some point it will be quite easy, if one wanted, to cause a great deal of harm with those models.\"In July, OpenAI launched a \"Superalignment\" team that aims to ensure that AGI aligns with human interest.Sutskever started an AI safety team at OpenAI to ensure the technology is in the human interest. JACK GUEZ/Getty Images\"Currently, we don't have a solution for steering or controlling a potentially superintelligent AI, and preventing it from going rogue,\" Sutskever and Jan Leike, the team's co-head, wrote in an OpenAI blog post in July.In mid-November, OpenAI's board, which includes Sutskever, ousted ex-CEO Sam Altman from the company. OpenAI's board, where Sutskever is a member, decided to oust ex-CEO Altman. OLIVIER DOULIERY/Getty ImagesBut soon thereafter, Sutskever apparently had second thoughts.\"I deeply regret my participation in the board's actions,\" Sutskever said in an X post on Monday. \"I never intended to harm OpenAI.\"\"I love everything we've built together and I will do everything I can to reunite the company,\" he wrote.Sutskever hinted at possible tension building up between him and Altman.Tensions reportedly brewed between Sutskever and Altman prior to the ex-CEO's ousting. JACK GUEZ/Getty ImagesThere may have been signs of trouble before the shocking ousting of Altman was announced on Friday.\"When you have an organization like OpenAI that's moving at a fast pace and pursuing ambitious goals, tension is inevitable,\" Sutskever told MIT Technology Review in September.Read the original article on Business Insider",
            "tickers": [
                "tsla"
            ],
            "img" : "https://i.insider.com/655b824822cf74a5739a1b92?width=1000&format=jpeg&auto=webp"
        },
        {
            "id": "-2480499126890428506",
            "title": "Sax Wealth Advisors LLC Has $1.20 Million Position in Tesla, Inc. (NASDAQ:TSLA)",
            "url": "https://www.tickerreport.com/banking-finance/11362856/sax-wealth-advisors-llc-has-1-20-million-position-in-tesla-inc-nasdaqtsla.html",
            "site": "tickerreport.com",
            "time": 1700506487000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Sax Wealth Advisors LLC raised its position in Tesla, Inc. (NASDAQ:TSLA – Free Report) by 1.2% in the second quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission (SEC). The fund owned 4,601 shares of the electric vehicle producer’s stock after acquiring an additional 54 shares during the […]",
            "tickers": [
                "tsla"
            ],
            "img" : "https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629"
        },
        {
            "id": "-5711040390055405149",
            "title": "With historic new deals in hand, UAW auto union targets Tesla, other automakers",
            "url": "https://www.thestreet.com/automotive/uaw-auto-union-detroit-three-strikes-tesla-electric-vehicles",
            "site": "thestreet.com",
            "time": 1700507303000,
            "favicon_url": "https://static.tickertick.com/website_icons/thestreet.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Following the conclusion of the union's historic stand-up strikes, the ratification process for the new contracts has officially concluded. The United Auto Workers union said Monday that it has officially ratified new contracts with each of the Detroit Three automakers. Across the three companies, about 64% of the union's nearly 150,000 members voted in favor of the contracts. The agreements include significant wage increases for members across the board, in addition to cost-of-living adjustments and the elimination of wage tiers.Related: Another legacy automaker has a powerful response to UAW auto union threatThe union said in a statement that throughout the life of the agreement — which will expire in April 2028 — members will raises of at least 33%. Some of the lowest-paid workers will see raises ranging up to 160% by 2028. The union said that tens of thousands of workers will see immediate 40% raises. The UAW additionally won a three-year progression to the top pay rate at each of the three companies, a progression that previously took eight years. Related: After $8 billion success, auto union targets Tesla, other automakersThe union said it won electric vehicle commitments at each of the Big Three automakers, something that had been a point of contention during negotiations. All three automakers are set to make multi-billion-dollar plant investments. With the strikes done and the contracts ratified, the automakers are anxious to get back on track quickly. \"Thankfully, we are on track to reach full production schedules in the coming days at our assembly plants in Michigan, Kentucky and Illinois that were affected during the strike,\" Ford CEO Jim Farley said Monday.The ratification process was narrowest at General Motors (GM) - Get Free Report, where the agreement passed with only about 55% of GM members voting in favor of it. The agreements at Ford (F) - Get Free Report and Stellantis each passed with nearly 70% favorability. “The members have spoken. After years of cutbacks, months of our Stand Up campaign, and weeks on the picket line, we have turned the tide for the American autoworker,” UAW President Shawn Fain said in a statement. Fain added that the strike against the Detroit Three was \"just the beginning.\" Related: Elon Musk's Tesla has a new union problem on the heels of historic union winThe UAW takes on the auto industry\"The UAW is back to setting the standard,\" he said. \"Now, we take our strike muscle and our fighting spirit to the rest of the industries we represent, and to millions of non-union workers ready to Stand Up and fight for a better way of life.” Fain's latest comment builds upon previous statements in which the union president has said that “workers at Tesla (TSLA) - Get Free Report, Toyota (TOYOF) - Get Free Report, Honda, and others are the UAW members of the future.”Bloomberg reported last month that a UAW organizing committee was discussing the benefits of unionization with workers at Tesla's Fremont, California plant. After bringing its strikes to a close in October, the union broadened its horizon, saying in a statement that it hopes to return to the bargaining table in 2028 with \"the Big Five or Big Six.\"Hyundai, Honda and Toyota have all boosted workers' wages in an attempt to protect against the threat of unionization. The UAW's historic set of stand-up strikes lasted roughly 40 days before the automakers, one-by-one, capitulated. Michael Swensen&solGetty Images Fain said last week that the union was noting interest in unionization from Tesla workers. Tesla and its CEO Elon Musk have been staunchly anti-union for years. Musk has often tweeted against unions and unionization, criticizing the UAW's recent efforts not long after the strikes began. An appeals court found in March that Tesla illegally fired a worker involved in unionization efforts in 2017. A \"union is just another corporation,\" Musk tweeted in 2022. \"Far better for many companies to compete for your skills, so that you have maximum optionality.\"Tesla additionally remains locked up in a dispute with Swedish union IF Metall, which is seeking better working conditions and wage increases. \"We already offer equivalent or better agreements than those covered by collective bargaining and find no reason to sign any other agreement,\" Tesla told Sweden's TT News Agency last week. Tesla shares ticked down slightly Monday. Related: Investors have finally had enough of Tesla CEO Elon MuskGet investment guidance from trusted portfolio managers without the management fees. Sign up for Action Alerts PLUS now.",
            "tickers": [
                "tsla"
            ]
        },
       
        {
            "id": "6198779671097333450",
            "title": "SpaceX's Starship should be ready to fly again before Christmas, Elon Musk says",
            "url": "https://www.space.com/spacex-starship-third-flight-readiness-four-weeks",
            "site": "space.com",
            "time": 1700506057000,
            "favicon_url": "https://static.tickertick.com/website_icons/space.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "SpaceX will likely be ready from a technical standpoint to launch its next Starship flight in just three to four weeks, Elon Musk said. But the FAA also has to clear the vehicle for liftoff.",
            "tickers": [
                "tsla"
            ],
            "img" : "https://cdn.mos.cms.futurecdn.net/QXERswXkEThcrdGHFdbzWQ-650-80.jpg.webp"
        },
        {
            "id": "-9149661465189509128",
            "title": "X’s CEO addresses advertiser exodus over Elon Musk outrage: ‘Data will tell the real story’",
            "url": "https://nypost.com/2023/11/20/business/x-ceo-linda-yaccarino-xs-addresses-advertiser-exodus-over-elon-musk-outrage/",
            "site": "nypost.com",
            "time": 1700505190000,
            "favicon_url": "https://static.tickertick.com/website_icons/nypost.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "X, formerly Twitter, lost several major advertisers including IBM and Comcast, and owner Elon Musk was blasted by the White House after he agreed with a post on the platform Wednesday. X, formerly Twitter, lost several major advertisers including IBM and Comcast, and owner Elon Musk was blasted by the White House after he agreed with a post on the platform Wednesday.",
            "tickers": [
                "tsla"
            ],
            "img" : "https://nypost.com/wp-content/uploads/sites/2/2023/11/2023-code-conference-ritz-carlton-50136529.jpg?resize=1064,709&quality=75&strip=all"
        },
        {
            "id": "-750702262629577257",
            "title": "IBM-led advertising X-odus gains steam as more flee Musk's platform",
            "url": "https://go.theregister.com/feed/www.theregister.com/2023/11/20/ibmled_advertising_xodus_gains_steam/",
            "site": "theregister.com",
            "time": 1700505010000,
            "favicon_url": "https://static.tickertick.com/website_icons/theregister.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Ad execs have reportedly urged CEO Yaccarino to step down in protest to save her reputation IBM may have led the latest advertising X-odus from Elon Musk's social media platform, but several other companies reportedly joined Big Blue over the weekend, amid calls for Twitter CEO Linda Yaccarino to quit to save face.…",
            "tickers": [
                "tsla"
            ],
            "img" : "https://th.bing.com/th?id=OVFT.ph1axxGizkokZ0FrdjVtUS&pid=News&w=300&h=186&c=14&rs=2&qlt=90&dpr=1.1"
        },
        {
            "id": "-8703790558100271585",
            "title": "Capital Performance Advisors LLP Purchases Shares of 1,243 Tesla, Inc. (NASDAQ:TSLA)",
            "url": "https://www.tickerreport.com/banking-finance/11362518/capital-performance-advisors-llp-purchases-shares-of-1243-tesla-inc-nasdaqtsla.html",
            "site": "tickerreport.com",
            "time": 1700504322000,
            "favicon_url": "https://static.tickertick.com/website_icons/tickerreport.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Capital Performance Advisors LLP acquired a new stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) in the second quarter, Holdings Channel.com reports. The firm acquired 1,243 shares of the electric vehicle producer’s stock, valued at approximately $325,000. Several other hedge funds have also made changes to their positions in the stock. Alpha Paradigm […]",
            "tickers": [
                "tsla"
            ],
            "img" : "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?w=250&h=150&zc=2&src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629"
        },
        {
            "id": "-6946429423419816709",
            "title": "Anti-Semitism on X: Musk defends himself, brands cut advertising",
            "url": "https://gettotext.com/anti-semitism-on-x-musk-defends-himself-brands-cut-advertising/",
            "site": "gettotext.com",
            "time": 1700504288000,
            "favicon_url": "https://static.tickertick.com/website_icons/gettotext.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Elon Musk reacted strongly to accusations of anti-Semitism targeting him after he approved anti-Semitic content in a message on of his social network. In a post published on Sunday, November 19, the owner of the social network protested against the papers “cans“media accusing him of anti-Semitism and said he did not wish”only the best for... Elon Musk reacted strongly to accusations of anti-Semitism targeting him after he approved anti-Semitic content in a message on of his social network. In a post published on Sunday, November 19, the owner of the social network protested against the papers “cans“media accusing him of anti-Semitism and said he did not wish”only the best for humanity“. Backlash erupted last week after the billionaire endorsed a post claiming Jews were harboring a “dialectical hatred” towards white people. This message has since been condemned from the White House to Tesla investors. “It is unacceptable to repeat this awful lie […] one month after the deadliest day for the Jewish people since the Holocaust” said Andrew Bates, White House spokesperson, referring to the attack carried out on October 7 against Israel by the Palestinian Islamist group Hamas. Elon Musk on Saturday threatened to sue media watchdog Media Matters and those who attacked his social network. “The very second court opens on Monday, X Corp will file a thermonuclear lawsuit against Media Matters and everyone who participated in this fraudulent attack on our company” Elon Musk wrote in a post on X, without naming other parties. Advertisers flee the social network, Musk advertises his premium subscription Elon Musk and ads from IBM, Apple and others had been placed alongside content promoting Adolf Hitler and the Nazi Party. Advertising, your content continues below Several large American companies have adopted measures to cut their advertising campaigns on X. Disney, Warner Bros. Discovery, Comcast, Lions Gate Entertainment and Paramount Global declared on Friday that they were suspending their advertising on did the same. IBM cut ads on Thursday, November 16. “Most of the biggest advertisers are the biggest oppressors of your right to free speech“, Musk reacted on X on Friday, while promoting the premium subscription which removes advertisements from users’ news feeds. Yaccarino remains in office According to Financial Times, which cites people familiar with the matter, several advertisers have privately asked Linda Yaccarino, CEO of X, to resign in order to save her reputation. However, she reportedly refused, saying she believed in the company’s mission. Linda Yaccarino said last Thursday that “When it comes to this platform, X has also been extremely clear about its efforts to combat anti-Semitism and discrimination. There is no place for this anywhere in the world — it is ugly and bad. And that’s all“. Hedge fund manager Bill Ackman has come to Elon Musk’s defense. The financier said last month he would be interested in a deal with X as part of a new investment vehicle that targets private companies looking to raise $1.5 billion. Sources: Bloomberg, Reuters, Financial Times. Advertising, your content continues below Source link -98",
            "tickers": [
                "tsla"
            ],
            "img" : "https://gettotext.com/wp-content/uploads/2023/11/Anti-Semitism-on-X-Musk-defends-himself-brands-cut-advertising.jpg"
        }
    ],
    "last_id": "-6946429423419816709"
}