{
    "stories": [
        {
            "id": "7528926398371252012",
            "title": "Yatra Online (NASDAQ:YTRA) Stock Price Passes Below 50 Day Moving Average of $1.90",
            "url": "https://www.etfdailynews.com/2023/11/19/yatra-online-nasdaqytra-stock-price-passes-below-50-day-moving-average-of-1-90/",
            "site": "etfdailynews.com",
            "time": 1700403882000,
            "favicon_url": "https://static.tickertick.com/website_icons/etfdailynews.com.ico",
            "tags": [
                "ytra"
            ],
            "description": "Yatra Online, Inc. (NASDAQ:YTRA – Get Free Report)’s stock price crossed below its 50 day moving average during trading on Friday . The stock has a 50 day moving average of $1.90 and traded as low as $1.52. Yatra Online shares last traded at $1.53, with a volume of 189,982 shares traded. Analyst Upgrades and […]",
            "tickers": [
                "ytra"
            ],
            "img" : "https://www.marketbeat.com/logos/yatra-online-inc-logo.jpg?v=20221220145240"
        },
        {
            "id": "-5059646490351337795",
            "title": "Yatra Online, Inc. (NASDAQ:YTRA) Q2 2024 Earnings Call Transcript",
            "url": "https://finance.yahoo.com/news/yatra-online-inc-nasdaq-ytra-191427959.html?.tsrc=rss",
            "site": "yahoo.com",
            "time": 1700334867000,
            "favicon_url": "https://static.tickertick.com/website_icons/yahoo.com.ico",
            "tags": [
                "ytra"
            ],
            "similar_stories": [
                "7528926398371252012",
                "1564346403002030134"
            ],
            "description": "Yatra Online, Inc. (NASDAQ:YTRA) Q2 2024 Earnings Call Transcript November 17, 2023 Operator: Hello everyone and welcome to today’s call titled the Yatra Fiscal Second Quarter 2024 Earnings Call. My name is Allen and I’ll be the call operator today. During the presentation all participants will be on mute however at the end of today’s […]",
            "tickers": [
                "ytra"
            ]
        },
        {
            "id": "1564346403002030134",
            "title": "Yatra Online, Inc. (YTRA) Q2 2024 Earnings Call Transcript | $YTRA",
            "url": "https://seekingalpha.com/article/4652672-yatra-online-inc-ytra-q2-2024-earnings-call-transcript",
            "site": "seekingalpha.com",
            "time": 1700230988000,
            "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
            "tags": [
                "ytra"
            ],
            "tickers": [
                "ytra"
            ],
            "img":"https://th.bing.com/th?id=OVFT.B4fSt71ubRBupvCdEmusLi&pid=News&w=300&h=186&c=14&rs=2&qlt=90&dpr=1.1"
        },
        {
            "id": "-8147222072933717196",
            "title": "Yatra Online to effect up to $5M share repurchase program",
            "url": "https://seekingalpha.com/news/4038175-yatra-online-to-effect-up-to-5m-share-repurchase-program",
            "site": "seekingalpha.com",
            "time": 1700226049000,
            "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
            "tags": [
                "ytra"
            ],
            "tickers": [
                "ytra"
            ],
            "img" : "https://th.bing.com/th?id=OVFT.wVf93hMNb_RKI24HdUJJ4C&pid=News&w=300&h=186&c=14&rs=2&qlt=90&dpr=1.1"
        },
        {
            "id": "5568366400678295532",
            "title": "Yatra Online reports Q2 results",
            "url": "https://seekingalpha.com/news/4038167-yatra-online-reports-q2-results",
            "site": "seekingalpha.com",
            "time": 1700224887000,
            "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
            "tags": [
                "ytra"
            ],
            "tickers": [
                "ytra"
            ],
            "img" :"https://www.livemint.com/lm-img/img/2023/11/14/600x338/Dhruv-Shringi--Yatra-Online-co-founder-and-CEO-_1699965936186_1699966015958.jpg"
        },
        {
            "id": "3224597697872365805",
            "title": "Yatra Online: Q2 Earnings Insights",
            "url": "https://www.benzinga.com/news/earnings/23/11/35846484/yatra-online-q2-earnings-insights",
            "site": "benzinga.com",
            "time": 1700224805000,
            "favicon_url": "https://static.tickertick.com/website_icons/benzinga.com.ico",
            "tags": [
                "ytra"
            ],
            "description": "Yatra Online (NASDAQ:YTRA) reported its Q2 earnings results on Friday, November 17, 2023 at 07:30 AM. Here's what investors need to know about the announcement. Earnings Yatra Online reported in-line EPS of $-0.03 versus an estimate of $-0.03. Revenue ...Full story available on Benzinga.com",
            "tickers": [
                "ytra"
            ]
        },
        {
            "id": "-5554793610232926725",
            "title": "Yatra Online, Inc.: Form 6-K - Report of foreign issuer [Rules 13a-16 and 15d-16]",
            "url": "https://www.sec.gov/Archives/edgar/data/1516899/000149315223041768/0001493152-23-041768-index.htm",
            "site": "sec.gov",
            "time": 1700224219000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "ytra"
            ],
            "tickers": [
                "ytra"
            ],
            "img":"https://th.bing.com/th/id/OIP.eV6I3C9rKcMwE6TNkbRA2QHaEK?w=202&h=113&c=7&r=0&o=5&dpr=1.1&pid=1.7"
        },
        {
            "id": "-7361698946497038394",
            "title": "YATRA ONLINE, INC. ANNOUNCES RESULTS FOR THE THREE MONTHS SEPTEMBER 30, 2023",
            "url": "https://www.benzinga.com/pressreleases/23/11/n35846334/yatra-online-inc-announces-results-for-the-three-months-september-30-2023",
            "site": "benzinga.com",
            "time": 1700224200000,
            "favicon_url": "https://static.tickertick.com/website_icons/benzinga.com.ico",
            "tags": [
                "ytra"
            ],
            "description": "GURUGRAM, India and NEW YORK, Nov. 17, 2023 /PRNewswire/ -- Yatra Online, Inc. (NASDAQ:YTRA) (the \"Company\"), India's leading corporate travel services provider and one of India's leading online travel companies, today announced its unaudited financial and operating results for the three months ended September 30, 2023. \"We delivered strong growth of Air Passengers booked up 31.2% YoY far outpacing domestic air passenger industry growth of 22.7% YoY, clearly demonstrating our ability to gain market share and the strength of the YATRA brand. Our revenue for the quarter ended September 30, 2023, was reported at INR 947.6 million (USD 11.4 million) up 14.0% YoY. Adjusted Margin from Air Ticketing of USD 12.3 million was down by 4.8% YoY largely on account of a 14.7% YoY softening in Air ticket prices. Adjusted EBITDA for the quarter reached INR 34.9 million (USD 0.4 million), lower vs. the September 2022 quarter at INR 77.7 million (USD 0.9 million). Yatra Online Limited, our Indian subsidiary, was successfully listed on the National Stock Exchange of India Limited and on the Bombay Stock Exchange on September 28, 2023 consummating the IPO of INR 7,750 million. The proceeds from this milestone will predominantly fuel our strategic growth, technology advancements, and customer-centric initiatives. We believe the IPO will also be beneficial to the consolidated company on several fronts as it provides a liquid stock that can be used for M&A in India. In addition, the transaction expands the shareholder base of the consolidated company by adding retail and institutional investors in India already familiar with Yatra's business and brand while increasing its visibility through a larger pool of equity analysts. Additionally, I would also like to share that the Board has authorized a share repurchase of up to $5 million of our NASDAQ listed YTRA shares, underscoring our confidence in Yatra's future and our steadfast commitment to delivering shareholder value. This authorization represents approximately 5% of Yatra Online, Inc's market capitalization based on the current share price. In conclusion, as we navigate the evolving landscape, our commitment remains unwavering — to leverage growth opportunities and ensure Yatra's continued ascent,\" said Dhruv Shringi, Co-founder and CEO. Financial and operating highlights for the three months ended September 30, 2023: ● Revenue of INR 947.6 million (USD 11.4 million), representing an increase of 14.0% year-over-year basis (\"YoY\"). ● Adjusted Margin (1) from Air Ticketing of INR 1,018.3 million (USD 12.3 million), representing a decrease of 4.8% YoY. ● Adjusted Margin (1) from Hotels and Packages of INR 278.3 million (USD 3.3 million), representing an increase of 15.6% YoY. ● Total Gross Bookings (Air Ticketing, Hotels and Packages and Other Services)(3) of INR 17,520.3 million (USD 210.9 million), representing an increase of 10.2% YoY. ● Loss for the period was INR 272.9 million (USD 3.3 million) versus a loss of INR 71.2 million (USD 0.9 million) for the three months ended September 30, 2022, reflecting an increase in loss by INR 201.6 million (USD 2.4 million) YoY. ● Result from operations were a loss of INR 120.6 million (USD 1.5 million) versus a loss of INR 5.8 million (USD 0.1 million) for the three months ended September 30, 2022, reflecting an increase in loss by INR 114.8 million (USD 1.4 million) YoY. ● Adjusted EBITDA(2) Profit was INR 34.9 million (USD 0.4 million) reflecting a decrease of 55.1% YOY. Three months ended September 30, 2022 2023 2023 Unaudited Unaudited Unaudited YoY Change (In thousands except percentages) INR INR USD % Financial Summary as per IFRS Revenue 831,378 947,574 11,405 14.0 % Results from operations (5,761) (120,598) (1,454) 1993.4 % Loss for the period (71,221) (272,862) (3,287) (283.1) % Financial Summary as per non-IFRS measures Full story available on Benzinga.com",
            "tickers": [
                "ytra"
            ]
        },
        {
            "id": "-6801602902880206461",
            "title": "Yatra Online, Inc. Announces $5 Million Share Repurchase Authorization",
            "url": "https://finance.yahoo.com/news/yatra-online-inc-announces-5-123000620.html?.tsrc=rss",
            "site": "yahoo.com",
            "time": 1700224200000,
            "favicon_url": "https://static.tickertick.com/website_icons/yahoo.com.ico",
            "tags": [
                "ytra"
            ],
            "similar_stories": [
                "-8147222072933717196"
            ],
            "description": "Yatra Online, Inc. (\"Company\" or \"Yatra\") (NASDAQ: YTRA) today announced that its Board of Directors has approved a share repurchase program, pursuant to which the Company is authorized to purchase up to $5 million of its outstanding ordinary shares, par value $0.0001 per share (\"Ordinary Shares\"), over an unlimited time period.",
            "tickers": [
                "ytra"
            ]
        },
        {
            "id": "-531656744574361934",
            "title": "Yatra Online, Inc.: Form 6-K - Report of foreign issuer [Rules 13a-16 and 15d-16]",
            "url": "https://www.sec.gov/Archives/edgar/data/1516899/000149315223041111/0001493152-23-041111-index.htm",
            "site": "sec.gov",
            "time": 1699996525000,
            "favicon_url": "https://static.tickertick.com/website_icons/sec.gov.ico",
            "tags": [
                "ytra"
            ],
            "similar_stories": [
                "-5554793610232926725"
            ],
            "tickers": [
                "ytra"
            ]
        },
        {
            "id": "-8083614321101156828",
            "title": "After A Profitable Q1 FY24, Yatra Online Slips Into Loss In Q2",
            "url": "https://inc42.com/buzz/after-a-profitable-q1-fy24-yatra-online-slips-into-loss-in-q2/",
            "site": "inc42.com",
            "time": 1699972118000,
            "favicon_url": "https://static.tickertick.com/website_icons/inc42.com.ico",
            "tags": [
                "ytra"
            ],
            "description": "Online travel aggregator Yatra Online saw its consolidated net losses surge nearly 11X year-on-year (YoY) to INR 17.1 Cr in… Online travel aggregator Yatra Online saw its consolidated net losses surge nearly 11X year-on-year (YoY) to INR 17.1 Cr in the second quarter (Q2) of the financial year 2023-24 (FY24) on the back of a fall in revenues. In contrast, the company reported a net loss of INR 1.56 Cr in the year-ago period. Sequentially, the company posted a net profit of nearly INR 6 Cr in Q1 FY24. Revenues from operations jumped 14% YoY to INR 94.1 Cr in Q2 FY24 compared to INR 82.4 Cr in Q2 FY23. On a quarter-on-quarter (QoQ) basis, operating revenue declined 14.5% from INR 110.1 Cr in Q1 FY24. Including other income, total income rose 8% YoY to INR 97.3 Cr in the quarter ended September 2023. Meanwhile, expenses continued to drag the company down. In Q2 FY24, total expenses zoomed more than 25% YoY to INR 113.5 Cr, up from INR 90.5 Cr in the year-ago period. Employee benefit expenses emerged as the biggest cost centre and contributed INR 36.6 Cr to the total expenses in Q2 FY24. Other expenses stood at INR 18.6 Cr and service costs accounted for nearly INR 16 Cr in Q2 FY24. Yatra claims to be one of the country’s largest online travel companies in terms of gross booking revenues and competes with the likes of players such as MakeMyTrip and EaseMyTrip. Yatra also claims to cater to more than 700 corporate customers and offer hotel bookings, holiday packages and homestays. The online travel aggregator claims to have more than 1.03 Lakh hotels in India and over 15 Lakh hotels available on its platform for booking. The Indian arm of the Nasdaq-listed Yatra Inc. made a muted debut on the Indian bourses in September this year. The stock got listed at INR 127.50 per share on the NSE and INR 130 on the BSE against the issue price of INR 142. Since then, the company has been hovering around the same range. Yatra closed 0.32% lower at INR 138.60 on the BSE on Tuesday (November 11). The post After A Profitable Q1 FY24, Yatra Online Slips Into Loss In Q2 appeared first on Inc42 Media.",
            "tickers": [
                "ytra"
            ]
        }
    ],
    "last_id": "-8083614321101156828"
}